schreibfaul1/ESP32-MiniWebRadio/src/common.h
  public:
    IR_buttons(settings_t* s){
        m_settings = s;
        m_numOfIrButtons = 0;
    }
    ~IR_buttons(){

    }

    int16_t hexStringToInt16(const char* str) {
        if (strcmp(str, "-1") == 0) { // Check if it's the special case '-1'
            return -1;  // Special case for unused keys
        }
        // Processing the hexadecimal value
        if (strlen(str) >= 3 && str[0] == '0' && tolower(str[1]) == 'x') {
            return (int16_t)strtol(str, NULL, 16);  // Convert Hexadecimal Value
        }
        Serial.println("Invalid format.");  // Error output if the format is not correct
        return 0;
    }

    const char* skipWhitespace(const char* str) {  // Helper function: Skip spaces
        while (*str && isspace(*str)) {
            str++;
        }
        return str;
    }

    const char* validateAndExtractString(const char* ptr, char** dest) {  // Error handling: Validation of quoted strings
        if (*ptr == '\"') {
            ptr++;  // skip '"'
            const char* start = ptr;
            while (*ptr && *ptr != '\"') {
                ptr++;
            }
            if (*ptr == '\"') {
                *dest = strndup(start, ptr - start);  // allocate mem for string
                return ptr + 1;  // skip '"'
            } else {
                Serial.println("Error: Unterminated string.");
                return NULL;
            }
        } else {
            Serial.println("Error: Expected string.");
            return NULL;
        }
    }

    bool parseJSONString(const char* jsonString) {  // Function to parse the JSON string
    const char* ptr = jsonString;
    uint8_t buttonNr = 0;
    size_t buttonIndex = 0;

    // Check if the JSON string starts with '['
    ptr = skipWhitespace(ptr);
    if (*ptr != '[') {
        Serial.println("Error: Expected '[' to start array.");
        return false;
    }
    ptr++;  // Überspringe '['

    // Process each JSON object in the array
    char key[16];
    while (*ptr && *ptr != ']' && buttonIndex < 43) {
        ptr = skipWhitespace(ptr);
        if (*ptr == '{') {
            ptr++;  // skip '{'
            int16_t val = 0xFF;
            char* label = NULL;
            bool validObject = false;

            while (*ptr && *ptr != '}') {
                ptr = skipWhitespace(ptr);

                // Schlüssel extrahieren
                if (*ptr == '\"') {
                    ptr++;  // skip '"'
                    const char* keyStart = ptr;
                    while (*ptr && *ptr != '\"') {
                        ptr++;
                    }
                    memset(key, 0, 16);
                    strncpy(key, keyStart, ptr - keyStart);
                    ptr++;  // skip '"'
                    ptr = skipWhitespace(ptr);

                    if (*ptr == ':') {
                        ptr++;  // skip ':'
                        ptr = skipWhitespace(ptr);
                        // Value based on key
                        if(key[0] =='A'){ // IR Address
                            buttonNr = 42;
                            char* str = NULL;
                            ptr = validateAndExtractString(ptr, &str);
                            if (!ptr) return false;  // error found
                            val = hexStringToInt16(str);  // Hex in uint8_t umwandeln
                            x_ps_free(&str);
                            validObject = true;
                        }
                        else if(key[0] == 'C'){; // IR command unused
                            buttonNr = 43;
                            char* str = NULL;
                            ptr = validateAndExtractString(ptr, &str);
                            if (!ptr) return false;  // error found
                            val = hexStringToInt16(str);  // Hex in uint8_t umwandeln
                            x_ps_free(&str);
                            validObject = true;
                        }
                        else if (isdigit(key[0])) {  // Nummer, z.B. "0", "10"
                            buttonNr = atoi(key);
                            char* str = NULL;
                            ptr = validateAndExtractString(ptr, &str);
                            if (!ptr) return false;  // error found
                            val = hexStringToInt16(str);  // Hex in uint8_t umwandeln
                            x_ps_free(&str);
                            validObject = true;
                        } else if (strcmp(key, "label") == 0) {  // Label
                            ptr = validateAndExtractString(ptr, &label);
                            if (!ptr) return false;  // error found
                        }
                    }
                }

                ptr = skipWhitespace(ptr);
                if (*ptr == ',') {
                    ptr++;  // skip ','
                }
            }

            // Make sure both values are present
            if (validObject && label != NULL) {
                m_settings->irbuttons[buttonNr].val = val;
                m_settings->irbuttons[buttonNr].label = label;
                // log_w("buttonNr %i, val %i, label %s", buttonNr, m_settings->irbuttons[buttonNr].val, m_settings->irbuttons[buttonNr].label);
                buttonIndex++;
            } else {
                Serial.println("Error: Invalid object, missing buttonNr or label.");
                return false;
            }

            ptr = skipWhitespace(ptr);
            if (*ptr == '}') {
                ptr++;  // skip '}'
            }

            ptr = skipWhitespace(ptr);
            if (*ptr == ',') {
                ptr++;  // skip ','
            }
        } else {
            Serial.println("Error: Expected '{' to start an object.");
            return false;
        }
    }

    // Check that the array ends correctly with ']'
    ptr = skipWhitespace(ptr);
    if (*ptr != ']') {
        Serial.println("Error: Expected ']' to close array.");
        return false;
    }
    return true;  // JSON parsed successfully
    }

    uint8_t loadButtonsFromJSON(const char* filename) { // Function to load the JSON data
        File file = SD_MMC.open(filename);
        if (!file) {
            Serial.println("Failed to open file");
            return false;
        }
        String jsonString;
        while (file.available()) {
            jsonString += (char)file.read();
        }
        file.close();
    //    log_w("%s", jsonString.c_str());
        // JSON parsen
        if (!parseJSONString(jsonString.c_str())) {
            Serial.println("Failed to parse JSON.");
            return false;
        }
        // debug output
        m_numOfIrButtons = 0;
        while(true) {
            if (m_settings->irbuttons[m_numOfIrButtons].label == NULL) break;

