schreibfaul1/ESP32-MiniWebRadio/src/common.h
            // if(m_settings->irbuttons[m_numOfIrButtons].val == -1) log_w("IR_buttonNr %02i, value -1,   label %s", m_numOfIrButtons, m_settings->irbuttons[m_numOfIrButtons].label);
            //  else log_w("IR_buttonNr %02i, value 0x%02X, label %s", m_numOfIrButtons, m_settings->irbuttons[m_numOfIrButtons].val, m_settings->irbuttons[m_numOfIrButtons].label);
            m_numOfIrButtons++;
        }
        m_settings->numOfIrButtons = m_numOfIrButtons;
        return m_numOfIrButtons;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class SD_content {
private:
    struct FileInfo {
        int32_t  fileSize;
        char*    fileName;
        char*    filePath;

        FileInfo(int32_t fs, const char* fn, const char* fp) : fileSize(fs), fileName(x_ps_strdup(fn)), filePath(x_ps_strdup(fp)) {}                 // constructor
        ~FileInfo() { x_ps_free(&fileName); x_ps_free(&filePath); }                                                                                  // destructor
        FileInfo(const FileInfo& other) : fileSize(other.fileSize), fileName(x_ps_strdup(other.fileName)), filePath(x_ps_strdup(other.filePath)) {}  // copy constructor
        FileInfo& operator=(const FileInfo& other) {   // copy assignment
            if (this != &other) {
                fileSize = other.fileSize;
                x_ps_free(&fileName);
                x_ps_free(&filePath);
                fileName = x_ps_strdup(other.fileName);
                filePath = x_ps_strdup(other.filePath);
            }
            return *this;
        }
    };
    std::vector<FileInfo> m_files;

    File m_masterFile;
    File m_slaveFile;
    char* m_buff = NULL;
    char* m_lastConnectedFile = NULL;
    char* m_lastConnectedFolder = NULL;
    char* m_lastConnectedFileName = NULL;
public:
    SD_content(){
        m_buff = x_ps_malloc(1024);
        freeFilesVector();
    }
    ~SD_content(){
        freeFilesVector();
        x_ps_free(&m_buff);
    }
    bool listFilesInDir(const char* path, boolean audioFilesOnly, boolean withoutDirs){
        if(!m_buff) {log_e("oom"); return false;}
        freeFilesVector();
        if(m_masterFile) m_masterFile.close();
        if(!SD_MMC.exists(path)) {
            SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s not exist", path);
            return false;
        }
        m_masterFile = SD_MMC.open(path);
        if(!m_masterFile.isDirectory()) {
            SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s is not a directory", path);
            m_masterFile.close();
            return false;
        }
        while(true) { // get content
            m_slaveFile = m_masterFile.openNextFile();
            if(!m_slaveFile) break;
            if(m_slaveFile.isDirectory()) {
                if(!withoutDirs) { // folder size is -1
                    char* path = x_ps_malloc(strlen(m_slaveFile.path()) + 3); strcpy(path, (const char*)m_slaveFile.path()); strcat(path, "/"); // add '/'
                    m_files.emplace_back((int) -1, m_slaveFile.name(), path);
                    x_ps_free(&path);
                }
            }
            else {
                if(audioFilesOnly) {
                    if(endsWith(m_slaveFile.name(), ".mp3") || endsWith(m_slaveFile.name(), ".aac") || endsWith(m_slaveFile.name(), ".m4a") || endsWith(m_slaveFile.name(), ".wav") || endsWith(m_slaveFile.name(), ".flac") ||
                       endsWith(m_slaveFile.name(), ".m3u") || endsWith(m_slaveFile.name(), ".opus") || endsWith(m_slaveFile.name(), ".ogg")) {
                        m_files.emplace_back(m_slaveFile.size(), m_slaveFile.name(), m_slaveFile.path());
                    }
                }
                else {
                    m_files.emplace_back(m_slaveFile.size(), m_slaveFile.name(), m_slaveFile.path());
                }
            }
        }
        sort();
        m_masterFile.close();
        return true;
    }

    bool isDir(uint16_t idx){
        if(idx >= m_files.size()) {log_e("idx %i is oor, max = %i", idx, m_files.size() - 1); return false;}
        if(m_files[idx].fileSize == -1) return true;
        return false;
    }
    size_t getSize(){
        return m_files.size();
    }
    const char* getColouredSStringByIndex(uint16_t idx){
        if(m_files.size() == 0)      {log_w("m_files.size() is 0"); return "";}
        if(m_files.size() < idx + 1) {log_w("idx %i is oor, max = %i", idx, m_files.size()); return "";}
        if(isDir(idx)) return m_files[idx].fileName;
        sprintf(m_buff, "%s" ANSI_ESC_YELLOW " %li" , m_files[idx].fileName, m_files[idx].fileSize);
        return m_buff;
    }
    const char* getFileNameByIndex(uint16_t idx){
        if(m_files.size() == 0)      {log_w("m_files.size() is 0"); return "";}
        if(m_files.size() < idx + 1) {log_w("idx %i is oor, max = %i", idx, m_files.size()); return "";}
        return m_files[idx].fileName;
    }

    int32_t getFileSizeByIndex(uint16_t idx){
        if(m_files.size() == 0)      {log_w("m_files.size() is 0"); return 0;}
        if(m_files.size() < idx + 1) {log_w("idx %i is oor, max = %i", idx, m_files.size()); return 0;}
        return m_files[idx].fileSize;
    }

    const char* getFilePathByIndex(uint16_t idx){
        if(m_files.size() == 0)      {log_w("m_files.size() is 0"); return "";}
        if(m_files.size() < idx + 1) {log_w("idx %i is oor, max = %i", idx, m_files.size()); return "";}
        /*
            dir_a
                dir_b
                    file_a
                    file_b
                file_c
                file_d

            getFilePathByIndex(0) returns "/dir_a/"
            getFilePathByIndex(3) returns "/dir_a/dir_b/file_b"
            getFilePathByIndex(5) returns "/dir_a/file_d"
        */
        return m_files[idx].filePath;
    }

    const char* getFileFolderByIndex(uint16_t idx){
        if(m_files.size() == 0)      {log_w("m_files.size() is 0"); return "";}
        if(m_files.size() < idx + 1) {log_w("idx %i is oor, max = %i", idx, m_files.size()); return "";}
        /*
            dir_a
                dir_b
                    file_a
                    file_b
                file_c
                file_d

