schreibfaul1/ESP32-MiniWebRadio/src/common.h
extern SemaphoreHandle_t mutex_display;
extern SD_content _SD_content;
class slider : public RegisterTable {
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    int16_t     m_val = 0;
    int16_t     m_minVal = 0;
    int16_t     m_maxVal = 0;
    uint16_t    m_leftStop = 0;
    uint16_t    m_rightStop = 0;
    uint32_t    m_bgColor = 0;
    uint32_t    m_railColor = 0;
    uint32_t    m_spotColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_objectInit = false;
    bool        m_backgroundTransparency = false;
    bool        m_saveBackground = false;
    uint8_t     m_railHigh = 0;
    uint16_t    m_middle_h = 0;
    uint16_t    m_spotPos = 0;
    uint8_t     m_spotRadius = 0;
    uint8_t     m_padding_left = 0;
    uint8_t     m_padding_right = 0;
    uint8_t     m_padding_top = 0;
    uint8_t     m_padding_bottom = 0;
    char*       m_name = NULL;
    releasedArg m_ra;
public:
    slider(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("slider");
        m_railHigh = 6;
        m_spotRadius = 12;
        m_bgColor = TFT_BLACK;
        m_railColor = TFT_BEIGE;
        m_spotColor = TFT_RED;
    }
    ~slider(){
        m_objectInit = false;
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t paddig_left, uint8_t paddig_right, uint8_t paddig_top, uint8_t paddig_bottom, int16_t minVal, int16_t maxVal){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_padding_left   = paddig_left;
        m_padding_right  = paddig_right;
        m_padding_top    = paddig_top;    // unused
        m_padding_bottom = paddig_bottom; // unused
        m_minVal = minVal;
        m_maxVal = maxVal;
        m_leftStop  = m_x +       m_padding_left +                   m_spotRadius + 10;  // x pos left stop
        m_rightStop = m_x + m_w - m_padding_left - m_padding_right - m_spotRadius - 10 ; // x pos right stop
        m_enabled = false;
        m_middle_h = m_y + (m_h / 2);
        m_spotPos = (m_leftStop + m_rightStop) / 2; // in the middle
        m_objectInit = true;
    }
    const char* getName() {
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;

        if(m_enabled){
            if(x < m_leftStop) x = m_leftStop;// (x, y) is in range
            if(x > m_rightStop) x = m_rightStop;
            m_clicked = true;
            drawNewSpot(x);
        }
        if(!m_clicked){ if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);}
        if(!m_enabled) return false;
        return true;
    }
    void setValue(int16_t val){
        if(!m_objectInit) return;
        if(val < m_minVal) val = m_minVal;
        if(val > m_maxVal) val = m_maxVal;
        m_val = val;
        if(m_clicked) return;
        uint16_t spotPos = map_l(val, m_minVal, m_maxVal, m_leftStop, m_rightStop); // val -> x
        if(m_enabled) drawNewSpot(spotPos);
        else m_spotPos = spotPos;
    }
    int16_t getValue(){
        return m_val;
    }
    void setNewMinMaxVal(int16_t minVal, int16_t maxVal){
        m_minVal = minVal;
        m_maxVal = maxVal;
    }
    void show(bool backgroundTransparency, bool saveBackground){
        m_backgroundTransparency = backgroundTransparency;
        m_saveBackground = saveBackground;
        m_enabled = true;
        int x = m_x + m_padding_left;
        int y = m_middle_h - (m_railHigh / 2);
        int w = m_w - m_padding_left - m_padding_right;
        int h = m_railHigh; (void) h;
        int r = 2;
        if(m_backgroundTransparency){
            if(m_saveBackground) tft.copyFramebuffer(0, 2, m_x, m_y, m_w, m_h);
            else                 tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        }
        tft.fillRoundRect(x, y, w, m_railHigh, r, m_railColor);
        drawNewSpot(m_spotPos);
    }
    void disable(){
        if(m_enabled)hide();
        m_enabled = false;
    }
    void hide(){
        if(m_backgroundTransparency){
            if(m_saveBackground) tft.copyFramebuffer(2, 0, m_x, m_y, m_w, m_h);
            else                 tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        }
        m_enabled = true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
private:
    int32_t map_l(int32_t x, int32_t in_min, int32_t in_max, int32_t out_min, int32_t out_max) {
        const int32_t run = in_max - in_min;
        if(run == 0) {
            log_e("map(): Invalid input range, %i == %i (min == max) in %s", in_min, in_max, m_name);
            return -1;
        }
        const int32_t rise = out_max - out_min;
        const int32_t delta = x - in_min;
        return round((float)(delta * rise) / run + out_min);
    }
    void drawNewSpot(uint16_t xPos){
        if(m_enabled){
            if(m_backgroundTransparency){
                if(m_saveBackground) tft.copyFramebuffer(2, 0, m_spotPos - m_spotRadius - 1, m_middle_h - m_spotRadius - 1, 2 * m_spotRadius + 2, 2 * m_spotRadius + 2);
                else                 tft.copyFramebuffer(1, 0, m_spotPos - m_spotRadius - 1, m_middle_h - m_spotRadius - 1, 2 * m_spotRadius + 2, 2 * m_spotRadius + 2);
            }
            else{
                tft.fillRect(             m_spotPos - m_spotRadius, m_middle_h - m_spotRadius, 2 * m_spotRadius, 2 * m_spotRadius + 1, m_bgColor);
            }
            tft.fillRect(                 m_spotPos - m_spotRadius - 1, m_middle_h - (m_railHigh / 2), 2 * m_spotRadius + 2, m_railHigh,   m_railColor);
            tft.fillCircle(xPos, m_middle_h, m_spotRadius, m_spotColor);
        }
        m_spotPos = xPos;
        int32_t val = map_l(m_spotPos, m_leftStop, m_rightStop, m_minVal, m_maxVal); // xPos -> val
        m_ra.val1 = val;
        if(graphicObjects_OnChange) graphicObjects_OnChange((const char*)m_name, val);
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class progressbar : public RegisterTable {
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    int16_t     m_val = 0;
    int16_t     m_minVal = 0;
    int16_t     m_maxVal = 0;
    int16_t     m_oldPos = 0;
    uint16_t    m_padding_left = 0;
    uint16_t    m_padding_right = 0;
    uint16_t    m_padding_top = 0;
    uint16_t    m_padding_bottom = 0;
    uint32_t    m_bgColor = 0;
    uint32_t    m_frameColor = 0;
    uint32_t    m_railColorLeft = 0;
    uint32_t    m_railColorRight = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_objectInit = false;
    bool        m_backgroundTransparency = true;
    bool        m_saveBackground = false;
    uint8_t     m_railHigh = 0;
    char*       m_name = NULL;
    releasedArg m_ra;
public:
    progressbar(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("progressbar");
        m_railHigh = 6;
        m_bgColor = TFT_BLACK;
        m_frameColor = TFT_WHITE;
        m_railColorLeft = TFT_RED;
        m_railColorRight = TFT_GREEN;
    }
    ~progressbar(){
        m_objectInit = false;
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t padding_left, uint16_t padding_right, uint16_t padding_top, uint16_t padding_bottom, int16_t minVal, int16_t maxVal){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_padding_left = padding_left;
        m_padding_right = padding_right;
        m_padding_top = padding_top;
        m_padding_bottom = padding_bottom;
        m_minVal = minVal;
        m_maxVal = maxVal;
        m_enabled = false;
        m_objectInit = true;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        m_ra.val1 = map_l(x,  m_x + 1, m_x + m_w - 2, m_minVal, m_maxVal);
        m_ra.val2 = m_ra.val1 - m_val; //offset
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        return true;
    }
    void setValue(int16_t val){
        if(!m_objectInit) return;
        if(val < m_minVal) val = m_minVal;
        if(val > m_maxVal) val = m_maxVal;
        m_val = val;
        if(m_clicked) return;
        if(m_enabled) drawChanges();
    }
    int16_t getValue(){
        return m_val;
    }
    void setNewMinMaxVal(int16_t minVal, int16_t maxVal){
        m_minVal = minVal;
        m_maxVal = maxVal;
    }
    void show(bool backgroundTransparency, bool saveBackground){
        m_backgroundTransparency = backgroundTransparency;
        m_saveBackground = saveBackground;
        if(m_backgroundTransparency){
            if(m_saveBackground) tft.copyFramebuffer(0, 2, m_x, m_y, m_w, m_h);
            else                 tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        }
        tft.drawRect(m_x + m_padding_left, m_y, m_w - m_padding_left - m_padding_right, m_h, m_frameColor);
        drawNewValue();
        m_enabled = true;
    }
    void disable(){
        m_enabled = false;
    }
    void hide(){
        if(m_backgroundTransparency){
            if(m_saveBackground) tft.copyFramebuffer(2, 0, m_x, m_y, m_w, m_h);
            else                 tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        }
        m_enabled = false;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
    void reset(){
        m_val = m_minVal;
        tft.fillRect(m_x, m_y + 1,  m_w  -  m_h - 1, m_h - 2, m_railColorRight);
    }
private:
    int32_t map_l(int32_t x, int32_t in_min, int32_t in_max, int32_t out_min, int32_t out_max) {
        const int32_t run = in_max - in_min;
        if(run == 0) {
            log_e("map(): Invalid input range, %i == %i (min == max) in %s", in_min, in_max, m_name);
            return -1;
        }
        const int32_t rise = out_max - out_min;
        const int32_t delta = x - in_min;
        return round((float)(delta * rise) / run + out_min);
    }
    void drawNewValue(){
        int x = m_x + 1 + m_padding_left;
        int w = m_w - 1 - m_padding_right;
        uint16_t pos = map_l(m_val, m_minVal, m_maxVal, x, x + w);
        tft.fillRect(x, m_y + 1,  pos, m_h - 2, m_railColorLeft);
        tft.fillRect(pos, m_y + 1,  w -  pos, m_h - 2, m_railColorRight);
        m_oldPos = pos;
        if(graphicObjects_OnChange) graphicObjects_OnChange((const char*)m_name, m_val);
    }
    void drawChanges(){
        int x = m_x + 1 + m_padding_left;
        int w = m_w - 1 - m_padding_right;
        uint16_t pos = map_l(m_val, m_minVal, m_maxVal, x, x + w);
        if(pos > m_oldPos){
            tft.fillRect(m_oldPos, m_y + 1, pos - m_oldPos, m_h - 2, m_railColorLeft);
        }
        if(pos < m_oldPos){
            tft.fillRect(pos, m_y + 1,  m_oldPos - pos, m_h - 2, m_railColorRight);
        }
        m_oldPos = pos;
        if(graphicObjects_OnChange) graphicObjects_OnChange((const char*)m_name, m_val);
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class textbox : public RegisterTable {
private:
    int16_t         m_x = 0;
    int16_t         m_y = 0;
    int16_t         m_w = 0;
    int16_t         m_h = 0;
    uint8_t         m_fontSize = 0;
    uint8_t         m_h_align = TFT_ALIGN_RIGHT;
    uint8_t         m_v_align = TFT_ALIGN_TOP;
    uint8_t         m_padding_left = 0; // left margin
    uint8_t         m_paddig_right = 0; // right margin
    uint8_t         m_paddig_top = 0; // top margin
    uint8_t         m_paddig_bottom = 0; // bottom margin
    uint8_t         m_borderWidth = 0;
    uint32_t        m_bgColor = 0;
    uint32_t        m_fgColor = 0;
    uint32_t        m_borderColor = 0;
    char*           m_text = NULL;
    char*           m_name = NULL;
    bool            m_enabled = false;
    bool            m_clicked = false;
    bool            m_autoSize = false;
    bool            m_narrow = false;
    bool            m_noWrap = false;
    bool            m_backgroundTransparency = false;
    bool            m_saveBackground         = false;
    releasedArg     m_ra;
public:
    textbox(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("textbox");
        m_bgColor = TFT_BLACK;
        m_fgColor = TFT_LIGHTGREY;
        m_borderColor = TFT_BLACK;
        m_fontSize = 1;
    }
    ~textbox(){
        x_ps_free(&m_text);
        x_ps_free(&m_name);
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t paddig_left, uint8_t paddig_right, uint8_t paddig_top, uint8_t paddig_bottom){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_padding_left  = paddig_left;
        m_paddig_right  = paddig_right;
        m_paddig_top    = paddig_top;
        m_paddig_bottom = paddig_bottom;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(bool backgroundTransparency, bool saveBackground){
        m_backgroundTransparency = backgroundTransparency;
        m_saveBackground = saveBackground;
        m_enabled = true;
        m_clicked = false;
        if(!m_text){m_text = strdup("");}
        if(m_saveBackground) tft.copyFramebuffer(0, 2, m_x, m_y, m_w, m_h);
        writeText(m_text);
    }
    void hide(){
        if(m_backgroundTransparency){
            if(m_saveBackground) tft.copyFramebuffer(2, 0, m_x, m_y, m_w, m_h);
            else                 tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        }
        m_enabled = false;
    }
    void disable(){
        m_enabled = false;
    }
    void enable(){
        m_enabled = true;
    }
    void setFont(uint8_t size){ // size 0 -> auto, choose besr font size
        m_fontSize = 0;
        if(size != 0) {m_fontSize = size; tft.setFont(m_fontSize);}
        else{m_autoSize = true;}
    }
    void setTextColor(uint32_t color){
        m_fgColor = color;
    }
    void setBGcolor(uint32_t color){
        m_bgColor = color;
    }
    void setBorderColor(uint32_t color){
        m_borderColor = color;
    }
    void setBorderWidth(uint8_t width){ // 0 = no border
        m_borderWidth = width;
        if(m_borderWidth > 2) m_borderWidth = 2;
        m_padding_left = max(m_padding_left, m_borderWidth);
        m_paddig_right = max(m_paddig_right, m_borderWidth);
        m_paddig_top = max(m_paddig_top, m_borderWidth);
        m_paddig_bottom = max(m_paddig_bottom, m_borderWidth);
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
    void setText(const char* txt, bool narrow = false, bool noWrap = false){ // prepare a text, wait of show() to write it
        if(!txt){txt = strdup("");}
        x_ps_free(&m_text);
        m_text = x_ps_strdup(txt);
        m_narrow = narrow;
        m_noWrap = noWrap;
    }
    void setAlign(uint8_t h_align, uint8_t v_align){
        m_h_align = h_align;
        m_v_align = v_align;
    }

    void writeText(const char* txt){
        if(!txt){txt = strdup("");}
        if(txt != m_text){ // no self copy
            x_ps_free(&m_text);
            m_text = x_ps_strdup(txt);
        }
        if(m_enabled){
            uint16_t txtColor_tmp = tft.getTextColor();
            uint16_t bgColor_tmp = tft.getBackGroundColor();
            tft.setTextColor(m_fgColor);
            tft.setBackGoundColor(m_bgColor);
            if(m_backgroundTransparency){
                if(m_saveBackground) tft.copyFramebuffer(2, 0, m_x, m_y, m_w, m_h);
                else                 tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
            }
            else{
                tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
            }
            if(m_fontSize != 0){ tft.setFont(m_fontSize);}
            int x = m_x + m_padding_left;
            int y = m_y + m_paddig_top;
            int w = m_w - (m_paddig_right + m_padding_left);
            int h = m_h - (m_paddig_bottom + m_paddig_top);
            if(m_borderWidth > 0){tft.drawRect(m_x, m_y, m_w, m_h, m_borderColor);}
            if(m_borderWidth > 1){tft.drawRect(m_x + 1, m_y + 1, m_w - 2, m_h - 2, m_borderColor);}
            tft.writeText(m_text, x, y, w, h, m_h_align, m_v_align, m_narrow, m_noWrap, m_autoSize);
            tft.setTextColor(txtColor_tmp);
            tft.setBackGoundColor(bgColor_tmp);
        }
    }
};
