schreibfaul1/ESP32-MiniWebRadio/src/common.h
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class timeString : public RegisterTable { // show time "hh:mm:ss" e.g. in header
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint8_t     m_fontSize = 0;
    uint8_t     m_h_align = TFT_ALIGN_CENTER;
    uint8_t     m_v_align = TFT_ALIGN_CENTER;
    uint32_t    m_bgColor = 0;
    uint32_t    m_fgColor = 0;
    uint32_t    m_borderColor = 0;
    char*       m_name = NULL;
    char        m_time[10] = "00:00:00";
    bool        m_enabled = false;
    bool        m_backgroundTransparency = false;
    bool        m_saveBackground = false;
    bool        m_clicked = false;
    releasedArg m_ra;
    textbox*    txt_time    = new textbox[8]{textbox("txt_timeH10"), textbox("txt_timeH01"), textbox("txt_timeC1"), textbox("txt_timeM10"),
                                  textbox("txt_timeM01"), textbox("txt_timeC2"), textbox("txt_timeS10"), textbox("txt_timeS01")}; // time of the day
public:
    timeString(const char* name, uint8_t fontSize){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("timeString");
        m_bgColor = TFT_BLACK;
        m_fgColor = TFT_LIGHTGREY;
        m_fontSize = fontSize;
    }
    ~timeString(){
        x_ps_free(&m_name);
        delete[] txt_time;
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t pl, uint16_t pr, uint16_t pt, uint16_t pb){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        uint8_t w_digits  = m_w / 7;
        uint8_t w_colon   = w_digits / 2;
        uint16_t xPos[8] = {
            static_cast<uint16_t>(m_x + pl + 0 * w_digits + 0 * w_colon), /* H10 */
            static_cast<uint16_t>(m_x + pl + 1 * w_digits + 0 * w_colon), /* H01 */
            static_cast<uint16_t>(m_x + pl + 2 * w_digits + 0 * w_colon), /* C1 */
            static_cast<uint16_t>(m_x + pl + 2 * w_digits + 1 * w_colon), /* M10 */
            static_cast<uint16_t>(m_x + pl + 3 * w_digits + 1 * w_colon), /* M01 */
            static_cast<uint16_t>(m_x + pl + 4 * w_digits + 1 * w_colon), /* C2 */
            static_cast<uint16_t>(m_x + pl + 4 * w_digits + 2 * w_colon), /* S10 */
            static_cast<uint16_t>(m_x + pl + 5 * w_digits + 2 * w_colon)  /* S01 */
        };
        uint8_t width[8]  = {w_digits, w_digits, w_colon, w_digits, w_digits, w_colon, w_digits, w_digits};
        for(uint8_t i = 0; i < 8; i++){
            txt_time[i].begin(xPos[i], m_y + pt, width[i], h, 0, 0, 0, 0);
            txt_time[i].setAlign(TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
            txt_time[i].setTextColor(m_fgColor);
            txt_time[i].setFont(m_fontSize);
        }
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(bool backgroundTransparency, bool saveBackground){
        m_backgroundTransparency = backgroundTransparency;
        m_saveBackground = saveBackground;
        m_enabled = true;
        if(m_saveBackground) tft.copyFramebuffer(0, 2, m_x, m_y, m_w, m_h);
        updateTime(m_time, true);
    }
    void hide(){
        if(m_backgroundTransparency){
            if(m_saveBackground) tft.copyFramebuffer(2, 0, m_x, m_y, m_w, m_h);
            else                 tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        }
        m_enabled = false;
    }
    void disable(){
        m_enabled = false;
    }
    void enable(){
        m_enabled = true;
    }
    void setFont(uint8_t size){ // size 0 -> auto, choose besr font size
        m_fontSize = size;
        m_fontSize = size; tft.setFont(m_fontSize);
    }
    void setTextColor(uint32_t color){
        m_fgColor = color;
        for(uint8_t i = 0; i < 8; i++) {
            txt_time[i].setTextColor(m_fgColor);
        }
    }
    void setBGcolor(uint32_t color){
        m_bgColor = color;
    }
    void setBorderColor(uint32_t color){
        m_borderColor = color;
    }
    void updateTime(const char* hl_time, bool complete = true){
        if(!hl_time) return;
        if(strlen(hl_time) != 8) return;
        if(!m_enabled) return;
        memcpy(m_time, hl_time, 8); // hhmmss
        static char oldtime[8] = {255}; // hhmmss
        tft.setFont(m_fontSize);
        tft.setTextColor(m_fgColor);
        if(complete == true) {
            if(m_backgroundTransparency){
                tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
            }
            else{
                tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
            }
            for(uint8_t i = 0; i < 8; i++) { oldtime[i] = 255; }
        }
        for(uint8_t i = 0; i < 8; i++) {
            if(oldtime[i] != m_time[i]) {
                char ch[2] = {0, 0};
                ch[0] = m_time[i];
                txt_time[i].setText(ch, true);
                txt_time[i].show(m_backgroundTransparency, m_saveBackground);
                oldtime[i] = m_time[i];
            }
        }
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class button1state : public RegisterTable { // click button
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint32_t    m_bgColor = 0;
    char*       m_defaultPicturePath = NULL;
    char*       m_clickedPicturePath = NULL;
    char*       m_inactivePicturePath = NULL;
    char*       m_alternativePicturePath = NULL; // e.g. IR select
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_backgroundTransparency = false;
    char*       m_name = NULL;
    releasedArg m_ra;
public:
    button1state(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("button1state");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        setDefaultPicturePath(NULL);
        setClickedPicturePath(NULL);
        setInactivePicturePath(NULL);
        setAlternativePicturePath(NULL);
    }
    ~button1state(){
        x_ps_free(&m_defaultPicturePath);
        x_ps_free(&m_clickedPicturePath);
        x_ps_free(&m_inactivePicturePath);
        x_ps_free(&m_alternativePicturePath);
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, bool backgroundTransparency = false){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_enabled = false;
        m_backgroundTransparency = backgroundTransparency;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(bool inactive = false){
        m_clicked = false;
        if(inactive){
            setInactive();
            return;
        }
        drawImage(m_defaultPicturePath, m_x, m_y, m_w, m_h);
        m_enabled = true;
    }
    void hide(){
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        }
        m_enabled = false;
    }
    void disable(){
        m_enabled = false;
    }
    void setInactive(){
        drawImage(m_inactivePicturePath, m_x, m_y, m_w, m_h);
        m_enabled = false;
    }
    void showAlternativePic(bool inactive = false){
        m_clicked = false;
        if(inactive){
            setInactive();
            return;
        }
        drawImage(m_alternativePicturePath, m_x, m_y, m_w, m_h);
    }
    void showClickedPic(){
        drawImage(m_clickedPicturePath, m_x, m_y, m_w, m_h);
    }
    void setDefaultPicturePath(const char* path){
        x_ps_free(&m_defaultPicturePath);
        if(path) m_defaultPicturePath = x_ps_strdup(path);
        else m_defaultPicturePath = x_ps_strdup("defaultPicturePath is not set");
    }
    void setClickedPicturePath(const char* path){
        x_ps_free(&m_clickedPicturePath);
        if(path) m_clickedPicturePath = x_ps_strdup(path);
        else m_clickedPicturePath = x_ps_strdup("clickedPicturePath is not set");
    }
    void setInactivePicturePath(const char* path){
        x_ps_free(&m_inactivePicturePath);
        if(path) m_inactivePicturePath = x_ps_strdup(path);
        else m_inactivePicturePath = x_ps_strdup("inactivePicturePath is not set");
    }
    void setAlternativePicturePath(const char* path){
        x_ps_free(&m_alternativePicturePath);
        if(path) m_alternativePicturePath = x_ps_strdup(path);
        else m_alternativePicturePath = x_ps_strdup("alternativePicturePath is not set");
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) {
            drawImage(m_clickedPicturePath, m_x, m_y, m_w, m_h);
            m_clicked = true;
        }
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
    //    if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        drawImage(m_defaultPicturePath, m_x, m_y, m_w, m_h);
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class button2state : public RegisterTable { // on off switch
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint32_t    m_bgColor = 0;
    char*       m_offPicturePath = NULL;
    char*       m_onPicturePath = NULL;
    char*       m_clickedOffPicturePath = NULL;
    char*       m_clickedOnPicturePath = NULL;
    char*       m_inactivePicturePath = NULL;
    char*       m_alternativeOnPicturePath = NULL;
    char*       m_alternativeOffPicturePath = NULL;
    bool        m_enabled = false;
    bool        m_active = true;
    bool        m_clicked = false;
    bool        m_state = false;
    char*       m_name = NULL;
    releasedArg m_ra;
public:
    button2state(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("button2state");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        setOffPicturePath(NULL);
        setOnPicturePath(NULL);
        setClickedOffPicturePath(NULL);
        setClickedOnPicturePath(NULL);
        setInactivePicturePath(NULL);
    }
    ~button2state(){
        x_ps_free(&m_offPicturePath);
        x_ps_free(&m_onPicturePath);
        x_ps_free(&m_clickedOffPicturePath);
        x_ps_free(&m_clickedOnPicturePath);
        x_ps_free(&m_inactivePicturePath);
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_enabled = false;
        m_active = true;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(){
        m_clicked = false;
        if(m_active){
            if(m_state) drawImage(m_onPicturePath, m_x, m_y, m_w, m_h);
            else        drawImage(m_offPicturePath, m_x, m_y, m_w, m_h);
            m_enabled = true;
        }
        else {
            drawImage(m_inactivePicturePath, m_x, m_y, m_w, m_h);
        }
    }
    void showClickedPic(){
        if(m_state){drawImage(m_clickedOnPicturePath, m_x, m_y, m_w, m_h);}
        else       {drawImage(m_clickedOffPicturePath, m_x, m_y, m_w, m_h);}
    }
    void showAlternativePic(){
        if(m_state){drawImage(m_alternativeOnPicturePath, m_x, m_y, m_w, m_h);}
        else       {drawImage(m_alternativeOffPicturePath, m_x, m_y, m_w, m_h);}
    }
    void setAlternativeOnPicturePath(const char* path){
        x_ps_free(&m_alternativeOnPicturePath);
        if(path) m_alternativeOnPicturePath = x_ps_strdup(path);
        else m_alternativeOnPicturePath = x_ps_strdup("alternativePicturePath is not set");
    }
    void setAlternativeOffPicturePath(const char* path){
        x_ps_free(&m_alternativeOffPicturePath);
        if(path) m_alternativeOffPicturePath = x_ps_strdup(path);
        else m_alternativeOffPicturePath = x_ps_strdup("alternativePicturePath is not set");
    }
    void hide(){
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        m_enabled = false;
    }
    void disable(){
        m_enabled = false;
    }
    void setValue(bool val){
        m_state = val;
        if(m_enabled) {
            if(m_state) drawImage(m_onPicturePath, m_x, m_y, m_w, m_h);
            else drawImage(m_offPicturePath, m_x, m_y, m_w, m_h);
        }
    }
    bool getValue(){
        return m_state;
    }
    void setOn(){
        m_state = true;
    }
    void setOff(){
        m_state = false;
    }
    void setActive(bool act){
        m_active = act;
    }
    bool getActive(){
        return m_active;
    }


    void setOffPicturePath(const char* path){
        x_ps_free(&m_offPicturePath);
        if(path) m_offPicturePath = x_ps_strdup(path);
        else m_offPicturePath = x_ps_strdup("defaultPicturePath is not set");
    }
    void setClickedOffPicturePath(const char* path){
        x_ps_free(&m_clickedOffPicturePath);
        if(path) m_clickedOffPicturePath = x_ps_strdup(path);
        else m_clickedOffPicturePath = x_ps_strdup("clickedOffPicturePath is not set");
    }
    void setClickedOnPicturePath(const char* path){
        x_ps_free(&m_clickedOnPicturePath);
        if(path) m_clickedOnPicturePath = x_ps_strdup(path);
        else m_clickedOnPicturePath = x_ps_strdup("clickedOnPicturePath is not set");
    }
    void setOnPicturePath(const char* path){
        x_ps_free(&m_onPicturePath);
        if(path) m_onPicturePath = x_ps_strdup(path);
        else m_onPicturePath = x_ps_strdup("clickedPicturePath is not set");
    }
    void setInactivePicturePath(const char* path){
        x_ps_free(&m_inactivePicturePath);
        if(path) m_inactivePicturePath = x_ps_strdup(path);
        else m_inactivePicturePath = x_ps_strdup("inactivePicturePath is not set");
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled){
            if(m_state) drawImage(m_clickedOnPicturePath, m_x, m_y, m_w, m_h);
            else        drawImage(m_clickedOffPicturePath, m_x, m_y, m_w, m_h);
            m_clicked = true;
            m_state = !m_state;
        }
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
    //    if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        if(m_state) drawImage(m_onPicturePath, m_x, m_y, m_w, m_h);
        else drawImage(m_offPicturePath, m_x, m_y, m_w, m_h);
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class numbersBox : public RegisterTable { // range 000...999
private:
    bool        m_enabled = false;
    uint8_t     m_segmWidth = 0;
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint32_t    m_bgColor = 0;
    bool        m_clicked = false;
    releasedArg m_ra;
    char*       m_name = NULL;
    char        m_root[20] = "/digits_small/";
    char        m_numbers[4] = "000";
public:
    numbersBox(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("numbersBox");

        if(TFT_CONTROLLER < 2) {m_segmWidth = 48;}
        else if (TFT_CONTROLLER < 7) {m_segmWidth = 64;}
        else m_segmWidth = 86;
    }
    ~numbersBox(){
        x_ps_free(&m_name);
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_enabled = false;
    }
    const char* getName(){
        return m_name;
    }
    bool show(){
        if(!m_enabled) return false;
        char path[50];
        for(uint8_t i = 0; i < 3; i++){
            sprintf(path,"%s%csbl.jpg", m_root, m_numbers[i]);
            if(!drawImage(path, m_x + i * m_segmWidth, m_y)) return false;;
        }
        return true;
    }
    void hide(){
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        m_enabled = false;
    }
    void disable(){
        m_enabled = false;
    }
    void enable(){
        m_enabled = true;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void setNumbers(uint16_t numbers){
        if(numbers > 999) return;
        snprintf(m_numbers, sizeof(m_numbers), "%03u", numbers);
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
    //    if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class pictureBox : public RegisterTable {
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint16_t    m_image_w = 0;
    uint16_t    m_image_h = 0;
    uint8_t     m_padding_left = 0; // left margin
    uint8_t     m_paddig_right = 0; // right margin
    uint8_t     m_paddig_top = 0; // top margin
    uint8_t     m_paddig_bottom = 0; // bottom margin
    uint32_t    m_bgColor = 0;
    char*       m_PicturePath = NULL;
    char*       m_altPicturePath = NULL;
    char*       m_name = NULL;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_backgroundTransparency = false;
    bool        m_saveBackground = false; // is used and to draw further objects on this box
    releasedArg m_ra;
public:
    pictureBox(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("pictureBox");
        setPicturePath(NULL);
        setAlternativPicturePath(NULL);
    }
    ~pictureBox(){
        x_ps_free(&m_name);
        x_ps_free(&m_PicturePath);
        x_ps_free(&m_altPicturePath);
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t paddig_left, uint8_t paddig_right, uint8_t paddig_top, uint8_t paddig_bottom){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_padding_left  = paddig_left;
        m_paddig_right  = paddig_right;
        m_paddig_top    = paddig_top;
        m_paddig_bottom = paddig_bottom;
        m_enabled = false;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    bool show(bool backgroundTransparency, bool saveBackground){
        m_backgroundTransparency = backgroundTransparency;
        m_saveBackground = saveBackground;
        int x = m_x + m_padding_left;
        int y = m_y + m_paddig_top;
        int w = m_w - (m_paddig_right + m_padding_left);
        int h = m_h - (m_paddig_bottom + m_paddig_top);
        if(!GetImageSize(m_PicturePath)){
            GetImageSize(m_altPicturePath);

