schreibfaul1/ESP32-MiniWebRadio/src/common.h
            if(m_saveBackground){
                tft.copyFramebuffer(1, 2, m_x, m_y, m_w, m_h);
            }
            if(m_backgroundTransparency){
                tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
            }
            m_enabled = drawImage(m_altPicturePath, x, y, w, h);
            if(m_saveBackground){
                tft.copyFramebuffer(0, 1, m_x, m_y, m_w, m_h);
            }
            return m_enabled;
        }
        else{
            if(m_saveBackground){
                tft.copyFramebuffer(1, 2, m_x, m_y, m_w, m_h);
            }
            if(m_backgroundTransparency){
                tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
            }
            m_enabled = drawImage(m_PicturePath, x, y, w, h);
            if(m_saveBackground){
                tft.copyFramebuffer(0, 1, m_x, m_y, m_w, m_h);
            }
            return m_enabled;
        }
    }
    void hide(){
        if(m_saveBackground){
            tft.copyFramebuffer(2, 1, m_x, m_y, m_w, m_h); // restore background
        }
        if(m_backgroundTransparency){
            tft.copyFramebuffer(1, 0, m_x, m_y, m_w, m_h);
        }
        else{
            tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        }
        m_enabled = false;
    }
    void disable(){
        if(m_saveBackground){
            tft.copyFramebuffer(2, 1, m_x, m_y, m_w, m_h); // restore background
        }
        m_enabled = false;
    }
    void enable(){
        m_enabled = true;
    }
    void setPicturePath(const char* path){
        if(m_PicturePath){x_ps_free(&m_PicturePath); m_PicturePath = NULL;}
        if(path) m_PicturePath = x_ps_strdup(path);
        else m_PicturePath = x_ps_strdup("picturePath is not set");
        if(path){GetImageSize(path);}
    }
    void setAlternativPicturePath(const char* path){
        x_ps_free(&m_altPicturePath);
        if(path) m_altPicturePath = x_ps_strdup(path);
        else m_altPicturePath = x_ps_strdup("alternativePicturePath is not set");
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
    //    if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        m_clicked = false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        return true;
    }
private:
    bool GetImageSize(const char* picturePath){
        const char* scaledPicPath = scaleImage(picturePath);
        if(!SD_MMC.exists(scaledPicPath)) {log_w("file %s not exists, objName: %s", scaledPicPath, m_name); return false;}
        File file = SD_MMC.open(scaledPicPath,"r", false);
        if(file.size() < 24) {log_w("file %s is too small", scaledPicPath); file.close(); return false;}
        char buf[8];
        file.readBytes(buf,3);
        if ((buf[0] == 0xFF) && (buf[1] == 0xD8) && (buf[2] == 0xFF)) { // format jpeg
            int16_t c1, c2;
            while(true){
                c1 = file.read();
                if(c1 == -1) {log_w("sof marker in %s not found", scaledPicPath); file.close(); return false;} //end of file reached
                if(c1 == 0xFF){c2 = file.read(); if(c2 == 0xC0) break;} // 0xFFC0 Marker found
            }
            file.readBytes(buf,7);
            m_image_h = buf[3] * 256 + buf[4];
            m_image_w = buf[5] * 256 + buf[6];
        //    log_i("w %i, h %i", m_w, m_h);
            return true;
        }
        if ((buf[0] == 'B') && (buf[1] == 'M') && (buf[2] == '6')) { // format bmp
            for(int i= 0; i < 15; i++) file.read(); // read 15 dummys
            m_image_w  = file.read(); // pos 18
            m_image_w += (file.read() << 8);
            m_image_w += (file.read() << 16);
            m_image_w += (file.read() << 24);
            m_image_h  = file.read(); // pos 22
            m_image_h += (file.read() << 8);
            m_image_h += (file.read() << 16);
            m_image_h += (file.read() << 24);
        //    log_i("w %i, h %i", m_w, m_h);
            return true;
        }
        if ((buf[0] == 'G') && (buf[1] == 'I') && (buf[2] == 'F')) { // format gif
            for(int i= 0; i < 3; i++) file.read(); // read 3 dummys
            m_image_w  = file.read(); // pos 6
            m_image_w += (file.read() << 8);
            m_image_h  = file.read(); // pos 8
            m_image_h += (file.read() << 8);
        //    log_i("w %i, h %i", m_w, m_h);
            return true;
        }
        if ((buf[0] == 0x89) && (buf[1] == 'P') && (buf[2] == 'N')) { // format png
            for(int i= 0; i < 13; i++) file.read(); // read 13 dummys
            m_image_w =  file.read() << 24; // pos 16
            m_image_w += file.read() << 16; // pos 17
            m_image_w += file.read() << 8;  // pos 18
            m_image_w += file.read() ;      // pos 19
            m_image_h =  file.read() << 24; // pos 20
            m_image_h += file.read() << 16; // pos 21
            m_image_h += file.read() << 8;  // pos 22
            m_image_h += file.read() ;      // pos 23

            // bitDepth  = header[24];  // Position 24 = Bit-Tiefe
            // colorType = header[25];  // Position 25 = Farbtyp
            // log_w("w %i, h %i", m_w, m_h);
            return true;
        }
        log_e("unknown picture format %s", picturePath);
        return false;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class imgClock24 : public RegisterTable { // draw a clock in 24h format
private:
    pictureBox* pic_clock24_digitsH10   = new pictureBox("clock24_digitsH10");   // digits hour   * 10
    pictureBox* pic_clock24_digitsH01   = new pictureBox("clock24_digitsH01");   // digits hour   * 01
    pictureBox* pic_clock24_digitsM10   = new pictureBox("clock24_digitsM10");   // digits minute * 10
    pictureBox* pic_clock24_digitsM01   = new pictureBox("clock24_digitsM01");   // digits minute * 01
    pictureBox* pic_clock24_digitsColon = new pictureBox("clock24_digitsColon"); // digits colon
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
#if TFT_CONTROLLER < 2
    uint16_t m_digitsYoffset = 30;
    //------------------------------------------------------------------------padding-left-right-top-bottom--------------------------------------------------
    struct w_h10  {uint16_t x =   4; uint16_t w =  72; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h10;   // Hour * 10     72 x 120 px
    struct w_h01  {uint16_t x =  76; uint16_t w =  72; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h01;   // Hour * 01     72 x 120 px
    struct w_c    {uint16_t x = 148; uint16_t w =  24; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_c;     // Colon         24 x 120 px
    struct w_m10  {uint16_t x = 172; uint16_t w =  72; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m10;   // Minute * 10   72 x 120 px
    struct w_m01  {uint16_t x = 244; uint16_t w =  72; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m01;   // Minute * 01   72 x 120 px
    //-------------------------------------------------------------------------------------------------------------------------------------------------------
#elif TFT_CONTROLLER < 7
    uint16_t m_digitsYoffset = 30;
    //------------------------------------------------------------------------padding-left-right-top-bottom--------------------------------------------------
    struct w_h10  {uint16_t x =  32; uint16_t w =  96; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h10;   // Hour * 10     96 x 160 px
    struct w_h01  {uint16_t x = 128; uint16_t w =  96; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h01;   // Hour * 01     96 x 160 px
    struct w_c    {uint16_t x = 224; uint16_t w =  32; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_c;     // Colon         32 x 160 px
    struct w_m10  {uint16_t x = 256; uint16_t w =  96; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m10;   // Minute * 10   96 x 160 px
    struct w_m01  {uint16_t x = 352; uint16_t w =  96; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m01;   // Minute * 01   96 x 160 px
    //-------------------------------------------------------------------------------------------------------------------------------------------------------
#else
    uint16_t m_digitsYoffset = 30;
    //------------------------------------------------------------------------padding-left-right-top-bottom--------------------------------------------------
    struct w_h10  {uint16_t x =  36; uint16_t w = 168; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h10;   // Hour * 10    168 x 260 px
    struct w_h01  {uint16_t x = 204; uint16_t w = 168; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h01;   // Hour * 01    168 x 260 px
    struct w_c    {uint16_t x = 372; uint16_t w =  56; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_c;     // Colon         56 x 260 px
    struct w_m10  {uint16_t x = 428; uint16_t w = 168; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m10;   // Minute * 10  168 x 260 px
    struct w_m01  {uint16_t x = 596; uint16_t w = 168; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m01;   // Minute * 01  168 x 260 px
    //-------------------------------------------------------------------------------------------------------------------------------------------------------
#endif
    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    bool        m_backgroundTransparency = false;
    uint16_t    m_digitsYPos = 0;
    bool        m_showAll = false;
    char*       m_name = NULL;
    char*       m_pathBuff = NULL;
    uint8_t     m_min = 0, m_hour = 0, m_weekday = 0;
    releasedArg m_ra;
public:
    imgClock24(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("imgClock24");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
    }
    ~imgClock24(){
        x_ps_free(&m_name);
        x_ps_free(&m_pathBuff);
        delete pic_clock24_digitsH10;
        delete pic_clock24_digitsH01;
        delete pic_clock24_digitsColon;
        delete pic_clock24_digitsM10;
        delete pic_clock24_digitsM01;
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_enabled = false;
        m_digitsYPos = m_y + m_digitsYoffset;
        pic_clock24_digitsH10->begin(  s_h10.x, m_digitsYPos, s_h10.w, s_h10.h, s_h10.pl, s_h10.pr, s_h10.pt, s_h10.pb);
        pic_clock24_digitsH01->begin(  s_h01.x, m_digitsYPos, s_h01.w, s_h01.h, s_h01.pl, s_h01.pr, s_h01.pt, s_h01.pb);
        pic_clock24_digitsColon->begin(s_c.x,   m_digitsYPos, s_c.w,   s_c.h,   s_c.pl,   s_c.pr,   s_c.pt,   s_c.pb);
        pic_clock24_digitsM10->begin(  s_m10.x, m_digitsYPos, s_m10.w, s_m10.h, s_m10.pl, s_m10.pr, s_m10.pt, s_m10.pb);
        pic_clock24_digitsM01->begin(  s_m01.x, m_digitsYPos, s_m01.w, s_m10.h, s_m01.pl, s_m01.pr, s_m01.pt, s_m01.pb);
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(bool inactive = false){
        m_clicked = false;
        if(inactive){
        //    setInactive();
            return;
        }
        m_enabled = true;
        m_showAll = true;
        writeTime(m_hour, m_min);
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
        m_showAll = false;
    }
    bool isDisabled(){
        return !m_enabled;
    }
    bool enable(){
        return m_enabled = true;
    }
    void updateTime(uint16_t minuteOfTheDay, uint8_t weekday){
        // minuteOfTheDay counts at 00:00, from 0...23*60+59
        // weekDay So - 0, Mo - 1 ... Sa - 6
        m_hour = minuteOfTheDay / 60;
        m_min  = minuteOfTheDay % 60;
        m_weekday  = weekday;
        if(m_enabled) writeTime(m_hour, m_min);
    }
    void writeTime(uint8_t m_hour, uint8_t  m_min){
        static uint8_t oldTime[4];
        static bool k = false;
        uint8_t time[5];
        time[0] = m_hour / 10; time[1] = m_hour % 10;
        time[2] = m_min / 10;  time[3] = m_min % 10;


