schreibfaul1/ESP32-MiniWebRadio/src/common.h
        for(uint8_t i = 0; i < 4; i++){
            if((time[i] != oldTime[i]) || m_showAll){
                sprintf(m_pathBuff, "/digits/sevenSegment/%igreen.jpg", time[i]);
                if(i == 0) {pic_clock24_digitsH10->setPicturePath(m_pathBuff); pic_clock24_digitsH10->show(m_backgroundTransparency, false);}
                if(i == 1) {pic_clock24_digitsH01->setPicturePath(m_pathBuff); pic_clock24_digitsH01->show(m_backgroundTransparency, false);}
                if(i == 2) {pic_clock24_digitsM10->setPicturePath(m_pathBuff); pic_clock24_digitsM10->show(m_backgroundTransparency, false);}
                if(i == 3) {pic_clock24_digitsM01->setPicturePath(m_pathBuff); pic_clock24_digitsM01->show(m_backgroundTransparency, false);}
            }
            oldTime[i] = time[i];
        }

        k = !k;
        if(k) {pic_clock24_digitsColon->setPicturePath("/digits/sevenSegment/dgreen.jpg"); pic_clock24_digitsColon->show(m_backgroundTransparency, false);}
        else  {pic_clock24_digitsColon->setPicturePath("/digits/sevenSegment/egreen.jpg"); pic_clock24_digitsColon->show(m_backgroundTransparency, false);}
        m_showAll = false;
    }

    bool positionXY(uint16_t x, uint16_t y){
        if(!m_enabled) return false;
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
    //    if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        m_clicked = false;
        return true;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class imgClock12 : public RegisterTable { // draw a clock in 12h format
private:
    pictureBox* pic_clock12_digitsH10    = new pictureBox("clock12_digitsH10");    // digits hour   * 10
    pictureBox* pic_clock12_digitsH01    = new pictureBox("clock12_digitsH01");    // digits hour   * 01
    pictureBox* pic_clock12_digitsM10    = new pictureBox("clock12_digitsM10");    // digits minute * 10
    pictureBox* pic_clock12_digitsM01    = new pictureBox("clock12_digitsM01");    // digits minute * 01
    pictureBox* pic_clock12_digitsColon  = new pictureBox("clock12_digitsColon");  // digits colon
    pictureBox* pic_clock12_digits_AM_PM = new pictureBox("clock12_digits_AM_PM"); // digits AM/PM
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint16_t    m_digitsYPos = 0;
#if TFT_CONTROLLER < 2
    uint16_t m_digitsYoffset = 30;
    //------------------------------------------------------------------------padding-left-right-top-bottom--------------------------------------------------
    struct w_h10  {uint16_t x =   0; uint16_t w =  56; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h10;   // Hour * 10     56 x 120 px
    struct w_h01  {uint16_t x =  56; uint16_t w =  56; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h01;   // Hour * 01     56 x 120 px
    struct w_c    {uint16_t x = 112; uint16_t w =  40; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_c;     // Colon         40 x 120 px
    struct w_m10  {uint16_t x = 152; uint16_t w =  56; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m10;   // Minute * 10   56 x 120 px
    struct w_m01  {uint16_t x = 208; uint16_t w =  56; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m01;   // Minute * 01   56 x 120 px
    struct w_ap   {uint16_t x = 264; uint16_t w =  56; uint16_t h = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_ap;    // AM_PM         56 x 120 px
    //-------------------------------------------------------------------------------------------------------------------------------------------------------
#elif TFT_CONTROLLER < 7
    uint16_t m_digitsYoffset = 30;
    //------------------------------------------------------------------------padding-left-right-top-bottom--------------------------------------------------
    struct w_h10  {uint16_t x =  16; uint16_t w =  80; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h10;   // Hour * 10     80 x 160 px
    struct w_h01  {uint16_t x =  96; uint16_t w =  80; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h01;   // Hour * 01     80 x 160 px
    struct w_c    {uint16_t x = 176; uint16_t w =  48; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_c;     // Colon         48 x 160 px
    struct w_m10  {uint16_t x = 224; uint16_t w =  80; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m10;   // Minute * 10   80 x 160 px
    struct w_m01  {uint16_t x = 304; uint16_t w =  80; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m01;   // Minute * 01   80 x 160 px
    struct w_ap   {uint16_t x = 384; uint16_t w =  80; uint16_t h = 160; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_ap;    // AM_PM         80 x 160 px
    //-------------------------------------------------------------------------------------------------------------------------------------------------------
#else
    uint16_t m_digitsYoffset = 30;
    //------------------------------------------------------------------------padding-left-right-top-bottom--------------------------------------------------
    struct w_h10  {uint16_t x =  36; uint16_t w = 130; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h10;   // Hour * 10    130 x 260 px
    struct w_h01  {uint16_t x = 166; uint16_t w = 130; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h01;   // Hour * 01    130 x 260 px
    struct w_c    {uint16_t x = 296; uint16_t w =  78; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_c;     // Colon         78 x 260 px
    struct w_m10  {uint16_t x = 374; uint16_t w = 130; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m10;   // Minute * 10  130 x 260 px
    struct w_m01  {uint16_t x = 504; uint16_t w = 130; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m01;   // Minute * 01  130 x 260 px
    struct w_ap   {uint16_t x = 634; uint16_t w = 130; uint16_t h = 260; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_ap;    // AM_PM        130 x 260 px
    //-------------------------------------------------------------------------------------------------------------------------------------------------------
#endif
    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    bool        m_showAll = false;
    bool        m_backgroundTransparency = false;
    char*       m_name = NULL;
    char*       m_pathBuff = NULL;
    uint8_t     m_min = 0, m_hour = 0, m_weekday = 0;
    releasedArg m_ra;
public:
    imgClock12(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("imgClock12");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
    }
    ~imgClock12(){
        x_ps_free(&m_name);
        x_ps_free(&m_pathBuff);
        delete pic_clock12_digitsH10;
        delete pic_clock12_digitsH01;
        delete pic_clock12_digitsColon;
        delete pic_clock12_digitsM10;
        delete pic_clock12_digitsM01;
        delete pic_clock12_digits_AM_PM;
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_enabled = false;
        m_digitsYPos = m_y + m_digitsYoffset;
        pic_clock12_digitsH10->begin(   s_h10.x, m_digitsYPos, s_h10.w, s_h10.h, s_h10.pl, s_h10.pr, s_h10.pt, s_h10.pb);
        pic_clock12_digitsH01->begin(   s_h01.x, m_digitsYPos, s_h01.w, s_h01.h, s_h01.pl, s_h01.pr, s_h01.pt, s_h01.pb);
        pic_clock12_digitsColon->begin( s_c.x,   m_digitsYPos, s_c.w,   s_c.h,   s_c.pl,   s_c.pr,   s_c.pt,   s_c.pb);
        pic_clock12_digitsM10->begin(   s_m10.x, m_digitsYPos, s_m10.w, s_m10.h, s_m10.pl, s_m10.pr, s_m10.pt, s_m10.pb);
        pic_clock12_digitsM01->begin(   s_m01.x, m_digitsYPos, s_m01.w, s_m10.h, s_m01.pl, s_m01.pr, s_m01.pt, s_m01.pb);
        pic_clock12_digits_AM_PM->begin(s_ap.x,  m_digitsYPos, s_ap.w,  s_ap.h,  s_ap.pl,  s_ap.pr,  s_ap.pt,  s_ap.pb);
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(bool inactive = false){
        m_clicked = false;
        if(inactive){
        //    setInactive();
            return;
        }
        m_enabled = true;
        m_showAll = true;
        writeTime(m_hour, m_min);
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
        m_showAll = false;
    }
    bool isDisabled(){
        return !m_enabled;
    }
    bool enable(){
        return m_enabled = true;
    }
    void updateTime(uint16_t minuteOfTheDay, uint8_t weekday){
        // minuteOfTheDay counts at 00:00, from 0...23*60+59
        // weekDay So - 0, Mo - 1 ... Sa - 6
        m_hour = minuteOfTheDay / 60;
        m_min  = minuteOfTheDay % 60;
        m_weekday  = weekday;
        if(m_enabled) writeTime(m_hour, m_min);
    }
    void writeTime(uint8_t m_hour, uint8_t  m_min){
        static uint8_t oldTime[4];
        static bool k = false;
        uint8_t time[5];
        time[0] = m_hour / 10; time[1] = m_hour % 10;
        time[2] = m_min / 10;  time[3] = m_min % 10;

        bool isPM = true;
        static bool isOldPM = false;
        for(uint8_t i = 0; i < 4; i++){
            uint8_t hour = m_hour;
            if(hour > 0 && hour < 13) isPM = false;
            else(hour -= 12);
            time[0] = hour / 10; time[1] = hour % 10;
            if((time[i] != oldTime[i]) || m_showAll){
                sprintf(m_pathBuff, "/digits/foldedNumbers/%iwhite.jpg", time[i]);
                if(i == 0) {pic_clock12_digitsH10->setPicturePath(m_pathBuff); pic_clock12_digitsH10->show(m_backgroundTransparency, false);}
                if(i == 1) {pic_clock12_digitsH01->setPicturePath(m_pathBuff); pic_clock12_digitsH01->show(m_backgroundTransparency, false);}
                if(i == 2) {pic_clock12_digitsM10->setPicturePath(m_pathBuff); pic_clock12_digitsM10->show(m_backgroundTransparency, false);}
                if(i == 3) {pic_clock12_digitsM01->setPicturePath(m_pathBuff); pic_clock12_digitsM01->show(m_backgroundTransparency, false);}
            }
            oldTime[i] = time[i];
        }
        if((isPM != isOldPM) || m_showAll){
            if(isPM) {pic_clock12_digits_AM_PM->setPicturePath("/digits/foldedNumbers/pmwhite.jpg"); pic_clock12_digits_AM_PM->show(m_backgroundTransparency, false);}
            else     {pic_clock12_digits_AM_PM->setPicturePath("/digits/foldedNumbers/amwhite.jpg"); pic_clock12_digits_AM_PM->show(m_backgroundTransparency, false);}
            isOldPM = isPM;
        }

        k = !k;
        if(k) {pic_clock12_digitsColon->setPicturePath("/digits/foldedNumbers/dwhite.jpg"); pic_clock12_digitsColon->show(m_backgroundTransparency, false);}
        else  {pic_clock12_digitsColon->setPicturePath("/digits/foldedNumbers/ewhite.jpg"); pic_clock12_digitsColon->show(m_backgroundTransparency, false);}

        m_showAll = false;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(!m_enabled) return false;
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
    //    if(!m_enabled) return false;
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        m_clicked = false;
        return true;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class alarmClock : public RegisterTable { // draw a clock in 12 or 24h format
private:
    pictureBox* pic_alarm_digitsH10   = new pictureBox("alarm_digitsH10");   // digits hour   * 10
    pictureBox* pic_alarm_digitsH01   = new pictureBox("alarm_digitsH01");   // digits hour   * 01
    pictureBox* pic_alarm_digitsM10   = new pictureBox("alarm_digitsM10");   // digits minute * 10
    pictureBox* pic_alarm_digitsM01   = new pictureBox("alarm_digitsM01");   // digits minute * 01
    pictureBox* pic_alarm_digitsColon = new pictureBox("alarm_digitsColon"); // digits colon
    textbox*    txt_alarm_days    = new textbox[7]{textbox("txt_alarm_days0"), textbox("txt_alarm_days1"), textbox("txt_alarm_days2"), textbox("txt_alarm_days3"),
                                                   textbox("txt_alarm_days4"), textbox("txt_alarm_days5"), textbox("txt_alarm_days6")}; // days of the week
    textbox*    txt_alarm_time    = new textbox[7]{textbox("txt_alarm_time0"), textbox("txt_alarm_time1"), textbox("txt_alarm_time2"), textbox("txt_alarm_time3"),
                                                   textbox("txt_alarm_time4"), textbox("txt_alarm_time5"), textbox("txt_alarm_time6")}; // time of the day

    int16_t  m_x = 0;
    int16_t  m_y = 0;
    int16_t  m_w = 0;
    int16_t  m_h = 0;
    uint16_t m_alarmdaysYPos    = 0;
    uint16_t m_alarmtimeYPos    = 0;
    uint16_t m_digitsYPos       = 0;
#if TFT_CONTROLLER < 2
    uint16_t m_alarmdaysXPos[7] = {2, 47, 92, 137, 182, 227, 272}; // same as altarmTimeXPos
    uint8_t  m_alarmdaysYoffset = 2;
    uint8_t  m_alarmdaysW = 44;
    uint8_t  m_alarmdaysH = 25;
    uint8_t  m_fontSize = 0; // auto
    //------------------------------------------------------------------------padding-left-right-top-bottom--------------------------------------------------
    struct w_h10  {uint16_t x =   4; uint16_t w = 72; uint16_t h = 104; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h10;   // Hour * 10    72 x 104 px
    struct w_h01  {uint16_t x =  76; uint16_t w = 72; uint16_t h = 104; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h01;   // Hour * 01    72 x 104 px
    struct w_c    {uint16_t x = 148; uint16_t w = 72; uint16_t h = 104; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_c;     // Colon        24 x 104 px
    struct w_m10  {uint16_t x = 172; uint16_t w = 72; uint16_t h = 104; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m10;   // Minute * 10  72 x 104 px
    struct w_m01  {uint16_t x = 244; uint16_t w = 72; uint16_t h = 104; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m01;   // Minute * 01  72 x 104 px
    //-------------------------------------------------------------------------------------------------------------------------------------------------------
#elif TFT_CONTROLLER < 7
    uint16_t m_alarmdaysXPos[7] = {9, 75, 141, 207, 273, 339, 405};
    uint8_t  m_alarmdaysYoffset = 2;
    uint8_t  m_alarmdaysW = 65;
    uint8_t  m_alarmdaysH = 23;
    uint8_t  m_fontSize = 0; // auto
    //------------------------------------------------------------------------padding-left-right-top-bottom--------------------------------------------------
    struct w_h10  {uint16_t x =  32; uint16_t w = 96; uint16_t h = 220; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h10;   // Hour * 10     96 x 150 px
    struct w_h01  {uint16_t x = 128; uint16_t w = 96; uint16_t h = 220; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h01;   // Hour * 01     96 x 150 px
    struct w_c    {uint16_t x = 224; uint16_t w = 32; uint16_t h = 220; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_c;     // Colon         32 x 150 px
    struct w_m10  {uint16_t x = 255; uint16_t w = 96; uint16_t h = 220; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m10;   // Minute * 10   96 x 150 px
    struct w_m01  {uint16_t x = 352; uint16_t w = 96; uint16_t h = 220; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m01;   // Minute * 01   96 x 150 px
    //-------------------------------------------------------------------------------------------------------------------------------------------------------
#else // 800 x 480px
    uint16_t m_alarmdaysXPos[7] = {50, 150, 250, 350, 450, 550, 650};
    uint8_t  m_alarmdaysYoffset = 10;
    uint8_t  m_alarmdaysW = 100;
    uint8_t  m_alarmdaysH = 32;
    uint8_t  m_fontSize = 0; // auto
    //------------------------------------------------------------------------padding-left-right-top-bottom--------------------------------------------------
    struct w_h10  {uint16_t x = 112; uint16_t w = 132; uint16_t h = 220; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h10;   // Hour * 10    132 x 220 px
    struct w_h01  {uint16_t x = 244; uint16_t w = 132; uint16_t h = 220; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_h01;   // Hour * 01    132 x 220 px
    struct w_c    {uint16_t x = 376; uint16_t w =  80; uint16_t h = 220; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_c;     // Colon         47 x 220 px
    struct w_m10  {uint16_t x = 423; uint16_t w = 132; uint16_t h = 220; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m10;   // Minute * 10  132 x 220 px
    struct w_m01  {uint16_t x = 555; uint16_t w = 132; uint16_t h = 220; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_m01;   // Minute * 01  132 x 220 px
    //-------------------------------------------------------------------------------------------------------------------------------------------------------
#endif

    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    bool        m_showAll = false;
    bool        m_backgroundTransparency = false;
    char*       m_name = NULL;
    char*       m_pathBuff = NULL;
    uint8_t*    m_alarmDays = NULL;
    int16_t*    m_alarmTime = NULL;
    uint8_t     m_min = 0, m_hour = 0, m_weekday = 0;
    int8_t      m_btnAlarmDay = -1;
    int8_t      m_btnAlarmTime = -1;
    int8_t      m_idx = 0;
    uint8_t     m_alarmDigits[4] = {0};
    const char* m_p1 = "/digits/sevenSegment/"; // path
    uint8_t     m_p1Len = 21;
    const char  m_WD[7][4] = {"SUN", "MON", "TUE", "WED", "THU", "FRI", "SAT"};
    releasedArg m_ra;

