schreibfaul1/ESP32-MiniWebRadio/src/common.h
public:
    alarmClock(const char* name){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("alarmClock");
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
        strcpy(m_pathBuff, m_p1);
    }
    ~alarmClock(){
        x_ps_free(&m_name);
        x_ps_free(&m_pathBuff);
        delete pic_alarm_digitsH10;
        delete pic_alarm_digitsH01;
        delete pic_alarm_digitsColon;
        delete pic_alarm_digitsM10;
        delete pic_alarm_digitsM01;
        delete[] txt_alarm_days;
        delete[] txt_alarm_time;
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_enabled = false;
        m_alarmdaysYPos    = m_y + m_alarmdaysYoffset; // m_y;
        m_alarmtimeYPos    = m_alarmdaysYPos + m_alarmdaysH + 1;
        m_digitsYPos       = m_alarmtimeYPos + m_alarmdaysH + 1;
        pic_alarm_digitsH10->begin(  s_h10.x, m_digitsYPos, s_h10.w, s_h10.h, s_h10.pl, s_h10.pr, s_h10.pt, s_h10.pb);
        pic_alarm_digitsH01->begin(  s_h01.x, m_digitsYPos, s_h01.w, s_h01.h, s_h01.pl, s_h01.pr, s_h01.pt, s_h01.pb);
        pic_alarm_digitsColon->begin(s_c.x,   m_digitsYPos, s_c.w,   s_c.h,   s_c.pl,   s_c.pr,   s_c.pt,   s_c.pb);
        pic_alarm_digitsM10->begin(  s_m10.x, m_digitsYPos, s_m10.w, s_m10.h, s_m10.pl, s_m10.pr, s_m10.pt, s_m10.pb);
        pic_alarm_digitsM01->begin(  s_m01.x, m_digitsYPos, s_m01.w, s_m10.h, s_m01.pl, s_m01.pr, s_m01.pt, s_m01.pb);
        for(uint8_t i = 0; i < 7; i++){
            txt_alarm_days[i].begin(m_alarmdaysXPos[i], m_alarmdaysYPos, m_alarmdaysW, m_alarmdaysH, 0, 0, 0, 0);
            txt_alarm_days[i].setAlign(TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
            txt_alarm_days[i].setBorderWidth(1);
            txt_alarm_days[i].setFont(m_fontSize);
            txt_alarm_days[i].setText(m_WD[i]);
            txt_alarm_time[i].begin(m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, 0, 0, 0, 0);
            txt_alarm_time[i].setAlign(TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
            txt_alarm_time[i].setBorderWidth(1);
            txt_alarm_time[i].setFont(m_fontSize);
        }
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(bool inactive = false){
        m_clicked = false;
        if(inactive){
        //    setInactive();
            return;
        }
        m_enabled = true;
        m_showAll = true;
        updateDigits();
        updateAlarmDaysAndTime();
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    void shiftRight(){
        m_idx++;
        if(m_idx == 4) m_idx = 0;
        m_showAll = true;
        updateDigits();
    }
    void shiftLeft(){
        m_idx--;
        if(m_idx == -1) m_idx = 0;
        m_showAll = true;
        updateDigits();
    }
    void digitUp(){
        if(m_idx == 0){ // 10h
            if(m_alarmDigits[0] == 2) return;
            if(m_alarmDigits[0] == 1 && m_alarmDigits[1] > 3) return;
            m_alarmDigits[0]++;
        }
        if(m_idx == 1){ // 1h
            if(m_alarmDigits[0] == 2 && m_alarmDigits[1] == 3) return;
            if(m_alarmDigits[1] == 9) return;
            m_alarmDigits[1]++;
        }
        if(m_idx == 2){ // 10m
            if(m_alarmDigits[2] == 5) return;
            m_alarmDigits[2]++;
        }
        if(m_idx == 3){ // 1m
            if(m_alarmDigits[3] == 9) return;
            m_alarmDigits[3]++;
        }
        m_showAll = true;
        updateDigits();
    }
    void digitDown(){
        if(m_idx == 0){ // 10h
            if(m_alarmDigits[0] == 0) return;
            m_alarmDigits[0]--;
        }
        if(m_idx == 1){ // 1h
            if(m_alarmDigits[1] == 0) return;
            m_alarmDigits[1]--;
        }
        if(m_idx == 2){ // 10m
            if(m_alarmDigits[2] == 0) return;
            m_alarmDigits[2]--;
        }
        if(m_idx == 3){ // 1m
            if(m_alarmDigits[3] == 0) return;
            m_alarmDigits[3]--;
        }
        m_showAll = true;
        updateDigits();
    }
    void setAlarmTimeAndDays(uint8_t* alarmDays, int16_t alarmTime[7]){
        m_alarmTime = alarmTime;
        m_alarmDays = alarmDays;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        for(int i = 0; i < 7; i++){
            if(txt_alarm_days[i].positionXY(x, y)) m_btnAlarmDay = i;
            if(txt_alarm_time[i].positionXY(x, y)) m_btnAlarmTime = i;
        }
        if(m_btnAlarmDay >= 0) alarmDaysPressed(m_btnAlarmDay);
        if(m_btnAlarmTime >= 0) alarmTimePressed(m_btnAlarmTime);
        return true;
    }
    bool released(){
        if(!m_enabled) return false;
        if(!m_clicked) return false;
        char hhmm[10] = "00:00";
        if(m_btnAlarmDay >= 0){
            sprintf(hhmm, "%02d:%02d", m_alarmTime[m_btnAlarmDay] / 60, m_alarmTime[m_btnAlarmDay] % 60);
        }
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);

        if(m_btnAlarmDay >= 0){
            uint8_t mask = 0b00000001;
            mask <<= m_btnAlarmDay;
            *m_alarmDays ^= mask;    // toggle the bit
            if(*m_alarmDays & mask){ // is set
                txt_alarm_days[m_btnAlarmDay].setBorderColor(TFT_RED);
                txt_alarm_days[m_btnAlarmDay].setTextColor(TFT_RED);
                txt_alarm_days[m_btnAlarmDay].setText(m_WD[m_btnAlarmDay]);
                txt_alarm_days[m_btnAlarmDay].show(m_backgroundTransparency, false);
                txt_alarm_time[m_btnAlarmDay].setBorderColor(TFT_GREEN);
                txt_alarm_time[m_btnAlarmDay].setTextColor(TFT_GREEN);
                txt_alarm_time[m_btnAlarmDay].setText(hhmm);
                txt_alarm_time[m_btnAlarmDay].show(m_backgroundTransparency, false);
            }
            else{                    // bit is not set
                txt_alarm_days[m_btnAlarmDay].setBorderColor(TFT_DARKGREY);
                txt_alarm_days[m_btnAlarmDay].setTextColor(TFT_DARKGREY);
                txt_alarm_days[m_btnAlarmDay].setText(m_WD[m_btnAlarmDay]);
                txt_alarm_days[m_btnAlarmDay].show(m_backgroundTransparency, false);
                txt_alarm_time[m_btnAlarmDay].setBorderColor(TFT_DARKGREY);
                txt_alarm_time[m_btnAlarmDay].setTextColor(TFT_DARKGREY);
                txt_alarm_time[m_btnAlarmDay].setText("");
                txt_alarm_time[m_btnAlarmDay].show(m_backgroundTransparency, false);
            }
            m_btnAlarmDay = -1;
        }
        if(m_btnAlarmTime >= 0){
            uint8_t mask = 0b00000001;
            mask <<= m_btnAlarmTime;
            if(mask & *m_alarmDays){ // bit is set -> alarm is active for that day
                txt_alarm_time[m_btnAlarmTime].setBorderColor(TFT_GREEN);
                txt_alarm_time[m_btnAlarmTime].setTextColor(TFT_GREEN);
                m_alarmTime[m_btnAlarmTime] = (m_alarmDigits[0] * 10 + m_alarmDigits[1]) * 60  + (m_alarmDigits[2] * 10 + m_alarmDigits[3]);
                char hhmm[10] = "00:00";
                sprintf(hhmm, "%02d:%02d", m_alarmTime[m_btnAlarmTime] / 60, m_alarmTime[m_btnAlarmTime] % 60);
                txt_alarm_time[m_btnAlarmTime].setText(hhmm);
                txt_alarm_time[m_btnAlarmTime].show(m_backgroundTransparency, false);
            }
            m_btnAlarmTime = -1;
        }
        m_clicked = false;
        return true;
    }
private:
    void updateDigits(){
        static uint8_t m_oldAlarmDigits[4] = {0};
        for(uint8_t i = 0; i < 4; i++){
            if(m_oldAlarmDigits[i] != m_alarmDigits[i] || m_showAll){
                m_pathBuff[m_p1Len + 0] = m_alarmDigits[i] + 48;
                m_pathBuff[m_p1Len + 1] = '\0';

