schreibfaul1/ESP32-MiniWebRadio/src/common.h
                if(i == m_idx){strcat(m_pathBuff, "orange.jpg");}
                else{          strcat(m_pathBuff, "red.jpg");}

                if(i == 0) {pic_alarm_digitsH10->setPicturePath(m_pathBuff); pic_alarm_digitsH10->show(m_backgroundTransparency, false);}
                if(i == 1) {pic_alarm_digitsH01->setPicturePath(m_pathBuff); pic_alarm_digitsH01->show(m_backgroundTransparency, false);}
                if(i == 2) {pic_alarm_digitsM10->setPicturePath(m_pathBuff); pic_alarm_digitsM10->show(m_backgroundTransparency, false);}
                if(i == 3) {pic_alarm_digitsM01->setPicturePath(m_pathBuff); pic_alarm_digitsM01->show(m_backgroundTransparency, false);}
            }
            m_oldAlarmDigits[i] = m_alarmDigits[i];
        }
        if(m_showAll){
            pic_alarm_digitsColon->setPicturePath("/digits/sevenSegment/dred.jpg");
            pic_alarm_digitsColon->show(m_backgroundTransparency, false);
        }
    }
    void updateAlarmDaysAndTime(){
        uint8_t mask = 0b00000001;
        uint16_t color = TFT_BLACK;

        for(int i = 0; i < 7; i++){
            // alarmDays
            if(*m_alarmDays & mask) color = TFT_RED;
            else color = TFT_DARKGREY;
            txt_alarm_days[i].setBorderColor(color);
            txt_alarm_days[i].setTextColor(color);
            txt_alarm_days[i].setText(m_WD[i]);
            txt_alarm_days[i].show(m_backgroundTransparency, false);
            char hhmm[10] = "00:00";
            sprintf(hhmm, "%02d:%02d", m_alarmTime[i] / 60, m_alarmTime[i] % 60);
            if(*m_alarmDays & mask){
                txt_alarm_time[i].setBorderColor(TFT_GREEN);
                txt_alarm_time[i].setTextColor(TFT_GREEN);
                txt_alarm_time[i].setText(hhmm);
            }
            else{
                txt_alarm_time[i].setBorderColor(TFT_DARKGREY);
                txt_alarm_time[i].setTextColor(TFT_DARKGREY);
                txt_alarm_time[i].setText("");
            }
            txt_alarm_time[i].show(m_backgroundTransparency, false);
            mask <<= 1;
        }
    }

    void alarmDaysPressed(uint8_t idx){
        txt_alarm_days[idx].setBorderColor(TFT_YELLOW);
        txt_alarm_days[idx].setTextColor(TFT_YELLOW);
        txt_alarm_days[idx].setText(m_WD[idx]);
        txt_alarm_days[idx].show(m_backgroundTransparency, false);
    }
    void alarmTimePressed(uint8_t idx){
        uint8_t mask = 0b00000001;
        mask <<= idx;
        if(mask & *m_alarmDays){ // bit is set -> active
            m_alarmTime[idx] = (m_alarmDigits[0] * 10 + m_alarmDigits[1]) * 60  + (m_alarmDigits[2] * 10 + m_alarmDigits[3]);
            char hhmm[10] = {0};
            sprintf(hhmm, "%02d:%02d", m_alarmTime[idx] / 60, m_alarmTime[idx] % 60);
            txt_alarm_time[idx].setBorderColor(TFT_YELLOW);
            txt_alarm_time[idx].setTextColor(TFT_YELLOW);
            txt_alarm_time[idx].setText(hhmm);
            tft.setTextColor(TFT_YELLOW);
            txt_alarm_time[idx].show(m_backgroundTransparency, false);
        }
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class uniList {

private:
    int16_t                   m_x = 0;
    int16_t                   m_y = 0;
    int16_t                   m_w = 0;
    int16_t                   m_h = 0;
    int32_t                   m_nr[10] = {0};
    uint8_t                   m_fontSize = 0;
    uint8_t                   m_tftSize = 0;
    uint8_t                   m_lineHight = 0;
    uint8_t                   m_mode = 0;
    uint32_t                  m_bgColor = 0;
    uint8_t                   m_indentContent = 0;
    uint8_t                   m_indentDirectory = 0;
    char*                     m_name = NULL;
    char*                     m_buff = NULL;
    char*                     m_txt[10] = {0};
    char*                     m_ext1[10] = {0};
    char*                     m_ext2[10] = {0};
    bool                      m_enabled = false;

public:
    uniList(const char* name){
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("dlnaList");
        m_bgColor = TFT_BLACK;
    }
    ~uniList(){
        x_ps_free(&m_name);
        x_ps_free(&m_buff);
        for(int i = 0; i < 10; i++){x_ps_free(&m_txt[i]); x_ps_free(&m_ext1[i]); x_ps_free(&m_ext2[i]);}
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t fontSize){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_fontSize = fontSize; // default font size
        m_enabled = false;
        m_lineHight = m_h / 10;
        m_buff = x_ps_malloc(1024);
    }
    void setMode(uint8_t mode, const char* tftSize, uint8_t fontSize){
        if(mode == RADIO)  {m_mode = RADIO;}
        if(mode == PLAYER) {m_mode = PLAYER;}
        if(mode == DLNA)   {m_mode = DLNA;}
        m_fontSize = fontSize;
        if(strcmp(tftSize, "s") == 0) m_tftSize = 1;
        if(strcmp(tftSize, "m") == 0) m_tftSize = 2;
        if(strcmp(tftSize, "l") == 0) m_tftSize = 3;
        switch(m_tftSize){
            case 1: if(m_mode == RADIO) {m_indentDirectory = 15; m_indentContent = 15;} // 320x240
                    if(m_mode == DLNA)  {m_indentDirectory = 10; m_indentContent = 15;}
                    if(m_mode == PLAYER){m_indentDirectory = 10; m_indentContent = 15;}
                    break;
            case 2: if(m_mode == RADIO) {m_indentDirectory = 20; m_indentContent = 20;} // 480x320
                    if(m_mode == DLNA)  {m_indentDirectory = 10; m_indentContent = 20;}
                    if(m_mode == PLAYER){m_indentDirectory = 10; m_indentContent = 20;}
                    break;
            case 3: if(m_mode == RADIO) {m_indentDirectory = 30; m_indentContent = 30;} // 800x480
                    if(m_mode == DLNA)  {m_indentDirectory = 10; m_indentContent = 30;}
                    if(m_mode == PLAYER){m_indentDirectory = 10; m_indentContent = 30;}
                    break;
        }
    }
    void clearList(){
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        for(int i = 0; i < 10; i++){
           x_ps_free(&m_txt[i]);
           x_ps_free(&m_ext1[i]);
           x_ps_free(&m_ext2[i]);
           m_nr[i] = -1;
        }
    }
    void drawLine(uint8_t pos, const char* txt, const char* ext1 = NULL, const char* ext2 = NULL, const char* color = ANSI_ESC_WHITE, int32_t nr = -1){
        if(pos > 9) return;
        if(!txt) return;
        tft.setFont(m_fontSize);
        if(m_mode == RADIO){
            sprintf(m_buff, ANSI_ESC_YELLOW "%03li %s%s" , nr, color, txt);
            if(txt ){x_ps_free(&m_txt[pos]);  m_txt[pos]  = strdup(txt);}
            if(ext1){x_ps_free(&m_ext1[pos]); m_ext1[pos] = strdup(ext1);}
            if(ext2){x_ps_free(&m_ext2[pos]); m_ext2[pos] = strdup(ext2);}
            m_nr[pos] = nr;
        }
        if(m_mode == DLNA){
            if(!txt) {log_e("txt is NULL"); return;}
            if(!ext1)                sprintf(m_buff, "%s%s", color, txt);
            else if(ext1[0] == '\0') sprintf(m_buff, "%s%s", color, txt);
            else                     sprintf(m_buff, "%s%s " ANSI_ESC_CYAN "(%s)" , color, txt, ext1);
            if(txt) {x_ps_free(&m_txt[pos]);  m_txt[pos] = strdup(txt);  m_nr[pos] = 1;}
            if(ext1){x_ps_free(&m_ext1[pos]); m_ext1[pos] = strdup(ext1);}
            if(ext2){x_ps_free(&m_ext2[pos]); m_ext2[pos] = strdup(ext2);}
        }
        if(m_mode == PLAYER){
            if(!txt) {log_e("txt is NULL"); return;}
            if(!nr)  sprintf(m_buff, "%s%s", color, txt);
            else     sprintf(m_buff, "%s%s" ANSI_ESC_YELLOW " %li" , color, txt, nr);
            if(txt) {x_ps_free(&m_txt[pos]);  m_txt[pos] = strdup(txt);  m_nr[pos] = nr;}
        }
        tft.writeText(m_buff, pos? m_indentContent : m_indentDirectory, m_y + pos *m_lineHight, m_w - 10, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
    }
    void drawPosInfo(int16_t firstVal, int16_t secondVal, int16_t total, const char* color){ // e.g. 1-9/65
        sprintf(m_buff, "%s%i-%i/%i", color, firstVal, secondVal, total);
        tft.writeText(m_buff, 0, m_y, m_w, m_lineHight, TFT_ALIGN_RIGHT, TFT_ALIGN_CENTER, true, true);
    }
    void colourLine(uint8_t pos, const char* color = ANSI_ESC_WHITE) {
        if(pos > 9) return;
        tft.setFont(m_fontSize);
        if(m_mode == RADIO){
            sprintf(m_buff, ANSI_ESC_YELLOW "%03li %s%s" , m_nr[pos], color, m_txt[pos]);
        }
        if(m_mode == PLAYER){
            if(m_nr[pos]) sprintf(m_buff, "%s%s" ANSI_ESC_YELLOW " %li", color, m_txt[pos], m_nr[pos]); // file
            else          sprintf(m_buff, "%s%s", color, m_txt[pos]);                                   // directory
        }
        tft.writeText(m_buff, pos? m_indentContent : m_indentDirectory, m_y + pos *m_lineHight, m_w - 10, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
    }
    const char* getTxtByPos(uint8_t pos){
        return m_txt[pos];
    }
    int16_t getNumberByPos(uint8_t pos){
        return m_nr[pos];
    }
    void drawTriangeUp(){
        auto triangleUp = [&](int16_t x, int16_t y, uint8_t s) { tft.fillTriangle(x + s, y + 0, x + 0, y + 2 * s, x + 2 * s, y + 2 * s, TFT_RED); };
        int line = 1;
        if(m_mode == RADIO) line = 0;
        triangleUp(0, m_y + (line* m_lineHight), m_lineHight / 3.5);
    }
    void drawTriangeDown(){
        auto triangleDown = [&](int16_t x, int16_t y, uint8_t s) { tft.fillTriangle(x + 0, y + 0, x + 2 * s, y + 0, x + s, y + 2 * s, TFT_RED); };
        triangleDown(0, m_y + (9 * m_lineHight), m_lineHight / 3.5);
    }

