schreibfaul1/ESP32-MiniWebRadio/src/common.h
private:
    void audioFileslist(uint16_t viewPos) {
        // guard -------------------------------------------------------------------------------------------------------------------------------------
        if(_SD_content.getSize() == 0) { ;  }                                           // folder empty
        if(viewPos >= _SD_content.getSize()) { viewPos = _SD_content.getSize() - 1; }   // viewPos too high
        //--------------------------------------------------------------------------------------------------------------------------------------------

        tft.setFont(m_fontSize);
        myList.setMode(PLAYER, m_tftSize, m_fontSize);
        myList.clearList();
        const char* color;

        color = m_folderColor;
        if(strcmp(m_curAudioFolder, "/audiofiles/") == 0) color = m_rootColor; // is root
        myList.drawLine(0, m_curAudioFolder, "", "", color, 0);
        color = m_fileColor;
        for (uint8_t pos = 1; pos < 10; pos++) {
            int idx = pos + viewPos - 1;
            if (pos == 1 && viewPos > 0 && _SD_content.getSize()) { myList.drawTriangeUp();}
            if (pos == 9 && viewPos + 9 < _SD_content.getSize())  { myList.drawTriangeDown();}
            if (viewPos + pos > _SD_content.getSize()) break;
            if (_SD_content.isDir(idx)){
                if (idx== m_curAudioFileNr){color = m_currentColor;}          // is current folder
                else                       {color = m_folderColor;}           // is folder
            }
            else {
                if (idx== m_curAudioFileNr){color = m_currentColor;}          // current file
                else                       {color = m_fileColor;}             // is file
            }
            if(_SD_content.isDir(idx)) myList.drawLine(pos, _SD_content.getFileNameByIndex(idx), "", "", color, 0);
            else                       myList.drawLine(pos, _SD_content.getFileNameByIndex(idx), "", "", color, _SD_content.getFileSizeByIndex(idx));
        }
        uint16_t firstVal = viewPos + 1;
        uint16_t secondVal = firstVal + 8;
        if(secondVal > _SD_content.getSize()) secondVal = _SD_content.getSize();
        myList.drawPosInfo(firstVal, secondVal, _SD_content.getSize(), ANSI_ESC_ORANGE); // shows the current items pos e.g. "30-39/210"
        return;
  }

    int calculateDisplayStartPosition(int list_size, int current_position) {
        // Calculate the theoretical starting position to get current_position to the middle
        int start_position = current_position - 4;
        // Make sure the starting position is not negative
        start_position = std::max(0, start_position);
        // Make sure the starting position doesn't go beyond the end of the list
        if (start_position + 9 > list_size) {
            start_position = std::max(0, list_size - 9);
        }
        return start_position;
    }


    void hasReleased(uint16_t x, uint16_t y){
        m_fileListPos = y / (m_h / 10);

        if(m_oldY && (m_oldY - 2 * m_lineHight > y)) { // -------------------------------------- normal wipe up
            m_browseOnRelease = 1;
            goto exit;
        }

        if(m_oldY && (m_oldY + 2 * m_lineHight < y)) { // -------------------------------------- normal wipe down
            m_browseOnRelease = 2;
            goto exit;
        }

        if(m_fileListPos == 0) { //  ----------------------------------------------------------- previous folder
            if(lastIndexOf(m_curAudioFolder, '/') > 0){  // not the first '/'
                m_browseOnRelease = 3;
            }
        }
        else {
            if(m_fileListPos + m_viewPos> _SD_content.getSize()) goto exit; // ----------------- next folder
            int idx = m_viewPos + m_fileListPos -1;
            if(_SD_content.isDir(idx)){
                strcpy(m_curAudioName, "");
                strcpy(m_curAudioFolder, _SD_content.getFileFolderByIndex(idx));
                m_browseOnRelease = 4;
            }
            else { // -------------------------------------------------------------------------- playfile
                strcpy( m_curAudioName, _SD_content.getFileNameByIndex(idx) );
                strcpy(m_curAudioFolder, _SD_content.getFileFolderByIndex(idx));
                strcpy(m_curAudioPath, _SD_content.getFilePathByIndex(idx));
                m_browseOnRelease = 5;
            }
        }
exit:
        return;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
extern stationManagement   staMgnt; /*
  ———————————————————————————————————————————————————————
  | Stations List                   Vol3    01:16:32    |           m_stationListPos
  | 017 BGRADIOk                                        |           <-- 0
  | 018 knixx.fm                                        |           <-- 1
  | 019 -0N-Chrismas on Radio                           |           <-- 2
  | 020 BBC 6music                                      |           <-- 3
  | 021 -0N-Movues on Radio                             |           <-- 4
  | 022 -0N-Top40 on Radio                              |           <-- 5
  | 023 Rockantenne Alternative (mp3)                   |           <-- 6
  | 024 Gra Wroclaw                                     |           <-- 7
  | 025 Classic EuroDisco                               |           <-- 8
  | 026 Hit Radio FFH - Soundtrack (AAC+)               |           <-- 9
  | 003   0:00    128K              IP:192.168.178.24   |
  ———————————————————————————————————————————————————————
*/
class stationsList : public RegisterTable {
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    int16_t     m_oldX = 0;
    int16_t     m_oldY = 0;
    uint8_t     m_lineHight = 0;
    uint16_t    m_firstStationsLineNr = 0;
    uint16_t*   m_curSstationNr = NULL;
    uint16_t    m_curStaNrCpy = 0;
    uint8_t     m_browseOnRelease = 0;
    uint8_t     m_fontSize = 0;
    uint8_t     m_stationListPos = 0;
    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    char*       m_name = NULL;
    char*       m_pathBuff = NULL;
    char*       m_buff = NULL;
    releasedArg m_ra;
    const char* m_colorToDraw = NULL;
    const char* m_staNameToDraw = NULL;
    const char* m_tftSize = NULL;
    uint16_t    m_staNrToDraw = 0;

