schreibfaul1/ESP32-MiniWebRadio/src/common.h
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class displayFooter : public RegisterTable {
  private:
    pictureBox* pic_Antenna   = new pictureBox("footer_Antenna");   // antenna symbol
    textbox*    txt_StaNr     = new textbox("footer_StaNr");        // station number
    pictureBox* pic_Flag      = new pictureBox("footer_Flag");      // flag symbol
    pictureBox* pic_Hourglass = new pictureBox("footer_Hourglass"); // hourglass symbol
    textbox*    txt_OffTimer  = new textbox("footer_OffTimer");     // off timer
    textbox*    txt_BitRate   = new textbox("footer_BitRate");      // bit rate
    textbox*    txt_IpAddr    = new textbox("footer_IPaddr");       // ip address
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    uint8_t     m_fontSize = 0;
    int8_t      m_timeCounter = 0;
    uint8_t     m_volume = 0;
    uint16_t    m_staNr = 0;
    uint16_t    m_offTime = 0;
    uint32_t    m_bitRate = 0;
    uint16_t    m_bgColor = TFT_BLACK;
    uint16_t    m_stationColor = TFT_LAVENDER;
    uint16_t    m_bitRateColor = TFT_LAVENDER;
    uint16_t    m_ipAddrColor = TFT_GREENYELLOW;
    char*       m_name = NULL;
    char*       m_ipAddr = NULL;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_backgroundTransparency = false;
    releasedArg m_ra;
    const char  m_stationSymbol[22]     = "/common/Antenna.png";
    const char  m_hourGlassymbol[2][27] = {"/common/Hourglass_blue.png", "/common/Hourglass_red.png"};
#if TFT_CONTROLLER < 2 // 320 x 240px
    //-----------------------------------------------------------padding-left-right-top-bottom-------------------------------------------
    struct w_a  {uint16_t x =   0; uint16_t w =  25; uint8_t pl =  2; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_Antenna;   // Antenna.png: 19 x 20 px
    struct w_s  {uint16_t x =  25; uint16_t w =  32; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_StaNr;
    struct w_f  {uint16_t x =  57; uint16_t w =  40; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_Flag;      // Flags:  33...40 x 20 px
    struct w_h  {uint16_t x = 100; uint16_t w =  20; uint8_t pl =  2; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_Hourglass; // Hourglass:   16 x 20 px
    struct w_o  {uint16_t x = 122; uint16_t w =  35; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_OffTimer;
    struct w_b  {uint16_t x = 158; uint16_t w =  42; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_BitRate;
    struct w_i  {uint16_t x = 200; uint16_t w = 120; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_IPaddr;
    //-----------------------------------------------------------------------------------------------------------------------------------
#elif TFT_CONTROLLER < 7 // 480 x 320px
    //-----------------------------------------------------------padding-left-right-top-bottom-------------------------------------------
    struct w_a  {uint16_t x =   1; uint16_t w =  30; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_Antenna;   // Antenna.png: 29 x 30 px
    struct w_s  {uint16_t x =  30; uint16_t w =  50; uint8_t pl =  2; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_StaNr;
    struct w_f  {uint16_t x =  80; uint16_t w =  48; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 3; uint8_t pb = 0;} const s_Flag;      // Flags:  40...48 x 24 px
    struct w_h  {uint16_t x = 132; uint16_t w =  24; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_Hourglass; // Hourglass:   23 x 30 px
    struct w_o  {uint16_t x = 160; uint16_t w =  54; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_OffTimer;
    struct w_b  {uint16_t x = 214; uint16_t w =  66; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_BitRate;
    struct w_i  {uint16_t x = 280; uint16_t w = 200; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_IPaddr;
    //-----------------------------------------------------------------------------------------------------------------------------------
#else // 800 x 480px
    //-----------------------------------------------------------padding-left-right-top-bottom-------------------------------------------
    struct w_a  {uint16_t x =   0; uint16_t w =  51; uint8_t pl =  2; uint8_t pr =  0; uint8_t pt = 1; uint8_t pb = 0;} const s_Antenna;   // Antenna.png: 47 x 48 px
    struct w_s  {uint16_t x =  51; uint16_t w =  84; uint8_t pl =  5; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_StaNr;
    struct w_f  {uint16_t x = 135; uint16_t w =  80; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 5; uint8_t pb = 0;} const s_Flag;      // Flags:  60...80 x 40 px
    struct w_h  {uint16_t x = 225; uint16_t w =  40; uint8_t pl =  2; uint8_t pr =  0; uint8_t pt = 3; uint8_t pb = 0;} const s_Hourglass; // Hourglass:   35 x 44 px
    struct w_o  {uint16_t x = 265; uint16_t w =  75; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_OffTimer;
    struct w_b  {uint16_t x = 340; uint16_t w = 110; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_BitRate;
    struct w_i  {uint16_t x = 450; uint16_t w = 350; uint8_t pl =  0; uint8_t pr =  0; uint8_t pt = 0; uint8_t pb = 0;} const s_IPaddr;
    //-----------------------------------------------------------------------------------------------------------------------------------
#endif
public:
    displayFooter(const char* name, uint8_t fontSize){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("displayFooter");
        m_bgColor = TFT_BLACK;
        m_fontSize = fontSize;
    }
    ~displayFooter(){
        x_ps_free(&m_name);
        x_ps_free(&m_ipAddr);
        delete pic_Antenna;
        delete txt_StaNr;
        delete pic_Flag;
        delete pic_Hourglass;
        delete txt_OffTimer;
        delete txt_BitRate;
        delete txt_IpAddr;
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w;
        m_h = h;
        pic_Antenna->begin(  s_Antenna.x,   m_y, s_Antenna.w,   m_h, s_Antenna.pl,   s_Antenna.pr,   s_Antenna.pt,   s_Antenna.pb);
        txt_StaNr->begin(    s_StaNr.x,     m_y, s_StaNr.w,     m_h, s_StaNr.pl,     s_StaNr.pr,     s_StaNr.pt,     s_StaNr.pb);
        pic_Flag->begin(     s_Flag.x,      m_y, s_Flag.w,      m_h, s_Flag.pl,      s_Flag.pr,      s_Flag.pt,      s_Flag.pb);
        pic_Hourglass->begin(s_Hourglass.x, m_y, s_Hourglass.w, m_h, s_Hourglass.pl, s_Hourglass.pr, s_Hourglass.pt, s_Hourglass.pb);
        txt_OffTimer->begin( s_OffTimer.x,  m_y, s_OffTimer.w,  m_h, s_OffTimer.pl,  s_OffTimer.pr,  s_OffTimer.pt,  s_OffTimer.pb);
        txt_BitRate->begin(  s_BitRate.x,   m_y, s_BitRate.w,   m_h, s_BitRate.pl,   s_BitRate.pr,   s_BitRate.pt,   s_BitRate.pb);
        txt_IpAddr->begin(   s_IPaddr.x,    m_y, s_IPaddr.w,    m_h, s_IPaddr.pl,    s_IPaddr.pr,    s_IPaddr.pt,    s_IPaddr.pb);

        txt_StaNr->setAlign(TFT_ALIGN_LEFT, TFT_ALIGN_CENTER);     txt_StaNr->setTextColor(m_stationColor); txt_StaNr->setFont(m_fontSize); // 0 -> auto
        txt_OffTimer->setAlign(TFT_ALIGN_LEFT, TFT_ALIGN_CENTER);  txt_OffTimer->setFont(m_fontSize); // 0 -> auto
        txt_BitRate->setAlign(TFT_ALIGN_CENTER, TFT_ALIGN_CENTER); txt_BitRate->setTextColor(m_bitRateColor); txt_BitRate->setBorderColor(m_bitRateColor); txt_BitRate->setBorderWidth(1); txt_BitRate->setFont(m_fontSize);  // 0 -> auto
        txt_IpAddr->setAlign(TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);  txt_IpAddr->setTextColor(m_ipAddrColor); txt_IpAddr->setFont(m_fontSize);   // 0 -> auto
        pic_Antenna->setPicturePath(m_stationSymbol);
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(bool transparency = false){
        m_backgroundTransparency = transparency;
        m_enabled = true;
        m_clicked = false;
        pic_Antenna->show(m_backgroundTransparency, false);
        updateStation(m_staNr);
        updateOffTime(m_offTime);
        updateBitRate(m_bitRate);
        if(m_ipAddr) writeIpAddr(m_ipAddr);
        else         writeIpAddr("");
    }
    void hide(){
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        m_enabled = false;
    }
    void enable(){
        m_enabled = true;
    }
    void disable(){
        m_enabled = false;
    }
    void setBGcolor(uint32_t color){
        m_bgColor = color;
    }
    void updateStation(uint16_t staNr){
        m_staNr = staNr;
        char buff[10];
        sprintf(buff, "%03d", m_staNr);
        txt_StaNr->setText(buff);   txt_StaNr->show(m_backgroundTransparency, false);
    }
    void setStationNrColor(uint16_t stationColor){
        m_stationColor = stationColor;
    }
    void updateFlag(const char* flag){
        if(flag){
            pic_Flag->setAlternativPicturePath("/flags/unknown.jpg");
            pic_Flag->setPicturePath(flag);
            pic_Flag->show(m_backgroundTransparency, false);
        }
        else{
            pic_Flag->hide();
        }
    }
    void updateOffTime(uint16_t offTime){
        m_offTime = offTime;
        if(!m_enabled) return;
        char buff[15];
        sprintf(buff, "%d:%02d", m_offTime / 60, m_offTime % 60);
        if(m_offTime){
            txt_OffTimer->setTextColor(TFT_RED);
            txt_OffTimer->setText(buff);
            txt_OffTimer->show(m_backgroundTransparency, false);
            pic_Hourglass->setPicturePath(m_hourGlassymbol[1]);
            pic_Hourglass->show(m_backgroundTransparency, false);
        }
        else{
            txt_OffTimer->setTextColor(TFT_DEEPSKYBLUE);
            txt_OffTimer->setText(buff);
            txt_OffTimer->show(m_backgroundTransparency, false);
            pic_Hourglass->setPicturePath(m_hourGlassymbol[0]);
            pic_Hourglass->show(m_backgroundTransparency, false);
        }
    }
    void updateTC(uint8_t timeCounter){
        m_timeCounter = timeCounter;
        if(!m_enabled) return;
        if(!m_timeCounter) {
            updateBitRate(m_bitRate);
        }
        else{
            uint16_t x0   = s_BitRate.x;
            uint16_t x1x2 = round(s_BitRate.x + ((float)((s_BitRate.w) / 10) * timeCounter)) - 1;
            uint16_t y0y1 = m_y + m_h - 5;
            uint16_t y2   = round((m_y  + m_h - 5) - ((float)(m_h - 6) / 10) * timeCounter);
            if(m_backgroundTransparency){
                tft.copyFramebuffer(1, 0, s_BitRate.x, m_y, s_BitRate.w, m_h);
            }
            else{
                tft.fillRect(s_BitRate.x, m_y, s_BitRate.w, m_h, m_bgColor);
            }
            tft.fillTriangle(x0, y0y1, x1x2, y0y1, x1x2, y2, TFT_RED);
        }
    }

