schreibfaul1/ESP32-MiniWebRadio/src/common.h
inline const char* aes_encrypt(const char* input) {
    static char* output = NULL;
    uint16_t len = strlen(input) / 16;
    len++;
    x_ps_free(&output);
    output = (char*) x_ps_calloc((len * 16) + 1, 1);
    mbedtls_aes_context aes;
    mbedtls_aes_init(&aes);
    mbedtls_aes_setkey_enc(&aes, (const unsigned char*) aesKey, 128);
    mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_ENCRYPT, (const unsigned char*) input, (unsigned char*) output);
    mbedtls_aes_free(&aes);
    return output;
}

inline const char* aes_decrypt(const char* input) {
    static char* output = NULL;
    uint16_t len = strlen(input) + 1;
    x_ps_free(&output);
    output = (char*) x_ps_calloc(len, 1);
    mbedtls_aes_context aes;
    mbedtls_aes_init(&aes);
    mbedtls_aes_setkey_dec(&aes, (const unsigned char*) aesKey, 128);
    mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_DECRYPT, (const unsigned char*) input, (unsigned char*) output);
    mbedtls_aes_free(&aes);
    return output;
}

inline void encode_base64(unsigned char* input, size_t input_len) {
    // Buffer-Größe berechnen für Base64-Kodierung
    size_t buffer_size = ((input_len + 2) / 3) * 4 + 1;
    unsigned char* output = (unsigned char*)malloc(buffer_size);  // Dynamischer Buffer

    size_t output_len;
    int ret = mbedtls_base64_encode(output, buffer_size, &output_len, input, input_len);

    if (ret == 0) {
        printf("Base64-Kodierung: %s\n", output);
    } else {
        printf("Fehler bei der Base64-Kodierung\n");
    }

    free(output);  // Buffer freigeben
}

inline void decode_base64(unsigned char* input, size_t input_len) {
    size_t output_len;
    // Buffer-Größe berechnen für Base64-Dekodierung
    size_t buffer_size = (input_len  / 4) * 3 + 1;
    unsigned char* output = (unsigned char*)malloc(buffer_size);  // Dynamischer Buffer

    // Dekodierung
    int ret = mbedtls_base64_decode((uint8_t*)output, sizeof(output), &output_len, (const unsigned char*)input, input_len);

    if (ret == 0) {
        printf("Dekodierter Text: %s\n", output);
    } else {
        printf("Fehler bei der Base64-Dekodierung\n");
    }
    free(output);  // Buffer freigeben
}